[
  {
    "review_description": "A necessity. But, the UX is bad and I would like some polishing. And it only tracks the foreground app. So, if you're using split screen, using YouTube in one half and Chrome on the other, and if you're scrolling in Chrome, Chrome will be counted and YouTube not. Split screen is a reality, the d...\nFull Review",
    "themes": [
      "Useful",
      "Design Flaws",
      "Add Features"
    ]
  },
  {
    "review_description": "The app is ok.. Everything is fine.. Useful app. But it is showing wrong timings of unlocking the screen. As it showed 29 times 5 mins ago and while I was using my phone after 5mins it is showing 31 times. But I haven't locked the screen in between this. Please fix it.",
    "themes": [
      "Useful",
      "Bugs"
    ]
  },
  {
    "review_description": "Complicated. The apps that I want to track are not shown on the list. It basically tracks the usage of the own app. Maybe Im terribly mistaken.. which proves the app is not intuitive.",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "Incomplete information. I played PUBG for 60 mins, and it is showing me nothing... Most of my app usage were not detected. Ex. Chrome(incognito mode)",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "The first day data was precise, consistent, and illuminating. The second day provided no data whatsoever. This seems like a bug which would be fixed soon. But for now the app is useless to me.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "In Oreo it's not counting all apps uses timing , screen lock counting also not working. I used my phone 1 hours but it's showing only 5 minutes and 0 time screen lock , but i did this minimum 13/15 times. Please help to resolve this .... Please",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "When “Take a Break” is on, is it possible to use recent button since I whitelist some apps when using the function, but I find it annoying that whenever I hit the recent button, it goes back to the take-a-break menu.",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "In MIUI it's not showing in notification bar even if you selected yes in settings. It's closes automatically when we close the app in task manager.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Working good on stock Android, but not working on the mi phones. When we remove app from recent apps, the quality time stops in mi phones",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Really well thought out. Simple yet powerful.. a helpful aid to seeing I use / over use my phone",
    "themes": [
      "Useful",
      "Time Management",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "Tracks all apps, but often says I've been on an app for hours at a time when I haven't even had my phone on me. I think I lock my phone while in an app and it continues to count this time as usage until I unlock again and exit that app.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Guys this appp doesnt work if it is not in background ..as it only showed my usage 4 min although i used around 4-5 hours Keep it out is the best app download it if u want something really helpful.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I purchased premium for my tablet but on my phone, the app doesn't recognise my premium privileges. It needs to be fixed as I won't pay twice",
    "themes": [
      "Price"
    ]
  },
  {
    "review_description": "Unfortunately the app includes background time in its records. Fir instance, according to the app I spent over 14 hours yesterday in Messaging. I can assure you I did not! A nice idea but . . .",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Worst app in the world i used my phone around 3 to 4 hours but this count only 1.30 hours",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "There should be an option to have multiple alerts, in specified time intervals e.g. every 30 mins, upon exceeding the Daily Usage Limit. Plus I wanted to pay for the app, to share my gratitude, but the amount is quite high. In INR or ₹ it should be around 100. Thanks.",
    "themes": [
      "Add Features",
      "Price"
    ]
  },
  {
    "review_description": "It was good before but the newest version has some major problems for example sometimes the app doesn't calculate usage time and stops working.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "A great app with good widgets that allows the creation of a profile (like Study) to help you control that phone usage addiction that you have :)",
    "themes": [
      "Addiction",
      "Studying"
    ]
  },
  {
    "review_description": "It is not working ,as it is to work please fix the bugs. Oneplus 6",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "it sometimes not worked... it foget its duty then i remind it......",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "The tracking automatically stops after some time. I again have to run the app and it starts again. Please solve this.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "it doesn't work unless you open it",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "The best app. Can you guys make it for windows desktop too",
    "themes": [
      "Other Devices"
    ]
  },
  {
    "review_description": "It worked great on my previous phone, but now it's not blocking any apps when scheduled :(",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I completed the purchase but the premium version hasn't been activated ! You must fix that .",
    "themes": [
      "Price"
    ]
  },
  {
    "review_description": "It is not counting time in which I have use parallel space",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Great app that gives you the inconvenient truth.",
    "themes": [
      "Self Monitoring",
      "Statistics"
    ]
  },
  {
    "review_description": "This is so useful I needed it I'm 100% sure that everybody with a phi need this app",
    "themes": [
      "Useful"
    ]
  },
  {
    "review_description": "Add a weekly limit option or all time stats",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Finally a Tracker for Mobile Usage. It's a Mobile Gym.",
    "themes": [
      "Self Monitoring",
      "Statistics",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "It's good but sometimes it's counting time even if the screen is off",
    "themes": [
      "Useful",
      "Bugs"
    ]
  },
  {
    "review_description": "Awesome app to reduce phone addiction",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "The best app ever. It has helped me to stay focused.",
    "themes": [
      "Useful",
      "Focus"
    ]
  },
  {
    "review_description": "This app helps me a lot to know the uses of phone",
    "themes": [
      "Self Monitoring",
      "Statistics"
    ]
  },
  {
    "review_description": "Using this app for 2 weeks..No problem..Accurate..Good job guys.",
    "themes": [
      "Accurate"
    ]
  },
  {
    "review_description": "Essential app for students,,,,😍",
    "themes": [
      "Studying"
    ]
  },
  {
    "review_description": "Awesome app, I love seeing usage reports for all my apps and games. Tells you which apps you use the most and tells you exactly how much usage time is invested in in each individual one. To DEVS: current version of your app is prone to crashing fits on Galaxy s9... Uninstall and reinstall fixed i...\nFull Review",
    "themes": [
      "Self Monitoring",
      "Statistics"
    ]
  },
  {
    "review_description": "Great app, wish it had an option to exclude some apps from the total daily usage though. For example I snooze my alarm for a long time in the mornings and it adds up to my usage. The same goes for music playing apps. It would have been great if I could exclude these apps from my usage sum.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "It is very useful application to track your usage of application. I really love this application. The Only feature i wish developers to add is tracking usage of application in certain time like 120 days and so. I have to count usage weekly and add them. Also this app doesn't block calls in perso...\nFull Review",
    "themes": [
      "Useful",
      "Statistics",
      "Add Features"
    ]
  },
  {
    "review_description": "Most recent version has a bug. Does not allow to share graphical report of top 5 apps yesterday. Used to work great. Text sharing still works. Using pixel, Android 8.1. Hoping a quick fix can be found. --update 2May2018, still no bug fix, c'mon people.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Love this app, really helped me reduce my screen time. However sometimes it counts my alarm in how many hours i've been on (so when I wake up, it says I've already been using it for 6 hours), how do I fix this?",
    "themes": [
      "Impulse Control"
    ]
  },
  {
    "review_description": "Latest update is kicking me out of apps which I've granted permissions to run. I now have to disable my assigned \"rest\" periods to get anything done. PLEASE FIX.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Great app. Helped me a lot. Just fix the daily report, it seldom works. Even after setting the timer, it won't show me notification. Also ,can't we save our daily progress in a more detailed way rather than only on some certain apps only?",
    "themes": [
      "Useful",
      "Detailing"
    ]
  },
  {
    "review_description": "It doesn't keep running in the background, so have to keep remembering to open the app first. Even then it keeps closing down on its own and doesn't track my usage a lot of the time. Also haven't been able to get a daily report. A real shame, cause I think the idea is great!",
    "themes": [
      "Design Flaws",
      "Bugs"
    ]
  },
  {
    "review_description": "Looks great but could never get it to work. Also all the grammar mistakes were killing me.",
    "themes": [
      "Design Flaws",
      "Bugs"
    ]
  },
  {
    "review_description": "Great app, but I would love if you could have an option to disable the notification with usage data from notifications bar without disabling all the notofications. Thanks for this app :)",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "How is it given 4.7 stars? It tracks lesser time then used. Totally useless application",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Besically saved me from becoming a screen addict. This app helps you unplug. The live screen timer is particularly useful to remind you to switch off...and on that note...",
    "themes": [
      "Addiction",
      "Impulse Control",
      "Timers & Blockers",
      "Unplug"
    ]
  },
  {
    "review_description": "The teaching works, but the fact that you can't change the settings to remove the sticky notification that it's running drives me bonkers.",
    "themes": [
      "Self Monitoring",
      "Design Flaws"
    ]
  },
  {
    "review_description": "Simple and encouraging! Makes phone media usage fun to self-monitor. Love the reminders and timer overlay and across apps!",
    "themes": [
      "Self Monitoring",
      "Timers & Blockers"
    ]
  },
  {
    "review_description": "Took me a while to figure out, but so far, very happy with it",
    "themes": [
      "Self Monitoring"
    ]
  },
  {
    "review_description": "It's awesome app...with best interface.. it's remind me What did i do and what i could do.. it's Amazing...good work ..!!",
    "themes": [
      "Statistics",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "Amazing and awesome app. Helped me to track my engagement with my device. Really Helpful",
    "themes": [
      "Self Monitoring",
      "Statistics"
    ]
  },
  {
    "review_description": "Properly shows the time you spend on your phone so you can improve yourself",
    "themes": [
      "Self Monitoring",
      "Statistics"
    ]
  },
  {
    "review_description": "Such an amazing app.....specially for those who spends time on social media...😃",
    "themes": [
      "Addiction",
      "Time Management"
    ]
  },
  {
    "review_description": "Easy to use interface. I am going to recommend the entire family use it.",
    "themes": [
      "Easy to Use"
    ]
  },
  {
    "review_description": "Awesome app. Really helpful in real life.",
    "themes": [
      "Useful"
    ]
  },
  {
    "review_description": "Advance tracking features and also remind mobile phone addiction is not good for our health.",
    "themes": [
      "Statistics",
      "Addiction"
    ]
  },
  {
    "review_description": "Quite possibly the most confusing onboarding ever. I couldn't use the app",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "Give option to add more app if necessary in setting... so new app can be added to the program even smaller numbers of app setting done during installation.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "awesome app if you are social addict useful app",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "oh wow, it's an amazing app to overcome the addiction of phone in their life.",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "I just downloaded this app just now and so far i really like it. It does what i wanted it to do. However, it would have been nice for there to be some directives on the front page when you are first introduced to the app. There is a button on the home page yo take u to certain places but i got on...\nFull Review",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "It worked until about 5 days in and then it just wouldn't recognize that I was using my phone. I would use my phone throughout the day and go to the app and it would say I hadn't used it. I even bought the subscription. I hope there is a fix coming out soon.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I cant get it to start monitoring. I'm not sure if I've done something wrong",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It would be perfect if there wasn't a bug where the icons of ~half of my apps don't show up in the list that forces me to remember the ranking in \"all apps\" and compare it to the normal list to get to see how much time I've spent on which app. The pie chart is great tho, and I love the design. O...\nFull Review",
    "themes": [
      "Bugs",
      "Statistics"
    ]
  },
  {
    "review_description": "Good app compare to other similar ones. 2 things though: 1) add the % of time in both the bar and pie view, helps to put things in perspective 2) the pie colors are just awful and not distinguishable, change them",
    "themes": [
      "Detailing"
    ]
  },
  {
    "review_description": "The best part is that its a light weight app and help us to have a control on our precious time that we waste on our smart fones and gadgets.Very user-friendly and fully worth installing it",
    "themes": [
      "Impulse Control",
      "Time Management"
    ]
  },
  {
    "review_description": "Best in the segment! Easy to use and light weight app to know much time we waste on smartphones, with cool features to manage phone usage.",
    "themes": [
      "Self Monitoring",
      "Statistics",
      "Easy to Use"
    ]
  },
  {
    "review_description": "A very much helpful app to track phone use and keep it optimised. I love the limit setting and reminder features the most which makes the app a totally reliable one. Worth downloading 👍",
    "themes": [
      "Self Monitoring",
      "Statistics",
      "Timers & Blockers"
    ]
  },
  {
    "review_description": "Doesn't track it accurately. Even though apps are closed but still running in the background it still tracks it. Also it didn't track even half of apps I used. Deleting.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Awesome app for everyone who wants to where we spend our time and how to manage it. Loved the simple and cool UI. The overall clean look killed it. Good work . Keep going.",
    "themes": [
      "Self Monitoring",
      "Statistics",
      "Easy to Use"
    ]
  },
  {
    "review_description": "Rubbish app, doesn't load at all or show the pages above!! No settings menu, just another data-stealing greedy app!! Hate greedy data-stealing apps, Robbery! Deleted, UK REVIEW",
    "themes": [
      "Privacy"
    ]
  },
  {
    "review_description": "The Apps is great. But I think it would be a lot better to actually block the apps after you reached the limit. Thank you.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Not worked for me... It's ok tht it tracked my time... But didn't notify me when I crossed my time limit!! Not much impressed",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It either doesn't work or I don't know how to use it. Couldn't get it to record any of my online usage.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "The live usage feature doesn't seem to work. Since that's the main reason I got the app, it's kind of important. There's dozens of usage takers out there, this was the main differentiating feature. Please fix it!",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Why do you tell me the time next to the apps instead of the power usage, that's what I want to know. How much power does an app use how much Mah for example not the stupid time. Isn't this obvious???",
    "themes": [
      "Detailing"
    ]
  },
  {
    "review_description": "Too much ad bloatware. Very irritating.",
    "themes": [
      "Performance"
    ]
  },
  {
    "review_description": "How about an average for a week or month? So you can compare your day to your average.",
    "themes": [
      "Detailing"
    ]
  },
  {
    "review_description": "Amazing usage tracking app. Love it!",
    "themes": [
      "Statistics"
    ]
  },
  {
    "review_description": "AppTym is a clean and light weight app to monitor the app usages which comes with best feature like LIVE APP USAGE TIME and you will love the way it switches between apps. Go ahead guys !",
    "themes": [
      "Statistics"
    ]
  },
  {
    "review_description": "Nice app with simple UI. Helps to know the time spent while using the phone. Great job done by the team keep going 😄",
    "themes": [
      "Easy to Use",
      "Self Monitoring",
      "Statistics"
    ]
  },
  {
    "review_description": "AppTym helped manage my time spent on phone. Setting limits reminded me to cut off extra time spent on an app. Grea Work!",
    "themes": [
      "Timers & Blockers",
      "Impulse Control"
    ]
  },
  {
    "review_description": "User friendly way to know how much time we are spending on our phone. can set our own limit of usage too... interesting idea, pretty lovely design, simple to use",
    "themes": [
      "Self Monitoring",
      "Statistics",
      "Timers & Blockers",
      "Timers & Blockers",
      "Good Idea",
      "Easy to Use"
    ]
  },
  {
    "review_description": "It's high time that we control the application in smartphone, rather it controls us...and this app does it for us.......A wonderful app.....Keep developing App Tym👍👍👍",
    "themes": [
      "Impulse Control"
    ]
  },
  {
    "review_description": "Easy way to know how you use your phone. Great UI. Loved the limiting option. I have more time for myself now. Great work AppTym. 😆👌",
    "themes": [
      "Self Monitoring",
      "Statistics",
      "Timers & Blockers",
      "Timers & Blockers",
      "Time Management"
    ]
  },
  {
    "review_description": "A very good way to know how my kid is using mobile. Liked the time limiting option. Simple UI. Good Work. Keep it up.",
    "themes": [
      "Parental Control",
      "Timers & Blockers",
      "Timers & Blockers"
    ]
  },
  {
    "review_description": "Excellent app to optimize your time to be more productive !!!",
    "themes": [
      "Productivity"
    ]
  },
  {
    "review_description": "Its highly recommended.A very thoughtful creation which is a great reminder. A complete ,plain and simple app to the common man. Gives a thorough detail on exact time spend on all the apps installed. Hats off to the creative minds...",
    "themes": [
      "Statistics"
    ]
  },
  {
    "review_description": "the app was busted it said I was on Snapchat from 12-6am (when I was asleep)....wasnt sure if it was because I left the app open but it should log when I'm active on it.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Awesome app, best in the category! Helped very much to track and manage my smartphone usage! Cool interface!",
    "themes": [
      "Self Monitoring",
      "Statistics"
    ]
  },
  {
    "review_description": "Great app.. really useful to monitor the time we spend on our devices!!!",
    "themes": [
      "Self Monitoring",
      "Statistics"
    ]
  },
  {
    "review_description": "I love the concept but the app doesn't work properly. It doesn't show any notifications although time exceed from limits u set. Except when you regulary open it. It try to send the message, then it crashed and stop working...",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I was never able to use the app because it only gave me a screen saying that I needed to allow usage stats permission. I did allow usage for the app several times but the screen never changed and there is no button to move it past this screen so for me it was just a useless app which is a shame be...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Very useful to track our time in cellphone usage! And change my time in the most important things, Thank you!",
    "themes": [
      "Self Monitoring",
      "Statistics"
    ]
  },
  {
    "review_description": "It is a low size good app but you should make this app more strict for addicted peoples .",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "Great app for phone addict.",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "Everything is great, but I'd like to suggest fix the problem of set up the time of permission using apps. Sometimes the timer is just empty and I need to turn off and turn on this set up button for a while when it starts work properly. And the it will be awesome, when users would can set up the t...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Love the app! However, just wondering whether you can link accounts across devices. It'd be great if I could have a daily limit for YouTube across both my tablet AND phone?",
    "themes": [
      "Other Devices"
    ]
  },
  {
    "review_description": "Love this app. You can block certain apps at certain times but if you must use them you can change your settings right then and there",
    "themes": [
      "Timers & Blockers"
    ]
  },
  {
    "review_description": "I greatly appreciate this app. It helps encourage me to stay off my phone, as I always want to beat my lowest record. It is funny that it doesn't track my social media use since I usually use the websites, so they're lumped under my internet browser app use. Dunno if there's a way to track indiv...\nFull Review",
    "themes": [
      "Unplug",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "It's a very good app but sometimes it does not start. It just keeps loading even though there is a stable Internet connection which prevents me from seeing statistics",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Almost two months since i started using this app, thanks for the good stuff, only thing is when i set daily limit for example on 1 hour total usage, i recently got the feeling that it undercalculates my usage time, like i would start using the 1 hour permited only app for 2 hours straight, not q...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Great AP but stopped working after only 12 hours. Really like it but doesn't work. UPDATED - app now working fine. Brilliant app. Just having it installed on my phone had made me more conscious of my phone usage and is helping me cut down how much I look at my phone. Highly recommended.",
    "themes": [
      "Impulse Control"
    ]
  },
  {
    "review_description": "Great app! Stops me from playing on my phone during family time. Only criticism is that the daily limit feature has been quite buggy for me. I tend not to reach my limit and then it rolls over my remaining time as the following day's limit rather than resetting. Other than that, it all works per...\nFull Review",
    "themes": [
      "Impulse Control",
      "Time Management"
    ]
  },
  {
    "review_description": "App is wonderful, however, I'm having an issue with the app getting stuck loading when I change a block setting. I have to force close it in order to get it to work again. The problem is reoccurring.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It is a good app if you are looking for something to fight your addiction. I have been using it for 2 months now and I admit that I brought my mobile usage from 3 hours a day to 15-30 minutes a day. Though it need some determination of the user too but I am so glad that I found this app on time ...\nFull Review",
    "themes": [
      "Addiction",
      "Time Management"
    ]
  },
  {
    "review_description": "Love the app it really stopped me from constantly unnecessarily using my phone, but one feature I would like to see is integrating blocking modes, for example: having a 40 minute DAILY LIMIT between a 1 pm and 10 pm SCHEDULE.",
    "themes": [
      "Impulse Control",
      "Add Features"
    ]
  },
  {
    "review_description": "It works in a way if I force myself not to change the setting to give myself more time on blocked app. It'd be better if we can setup the timeframe for blocking the app setting itself.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Hanging or showing error message upon clicking Close button for first launch. Please correct ASAP, thanks.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Good in the way it functions, though too easy to circumvent. Would good to need (eg) a 30 character password, or a long lockout between changes. Would also be good to be able to fine tune the times of restriction, not just in whole hours,",
    "themes": [
      "Bypassable",
      "Add Features"
    ]
  },
  {
    "review_description": "Doesn't work on my phone always telling me to update the version application and I just downloaded it, and then it doesn't connect with the others applications of my device (Instagram fb...). Completely useless for the moment",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Cannot move from access permissions screen to start using tbe app, have to uninstall it. LG V20 smartphone.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "The app stops by itself. I have to keep it restarting every time. Any of the developers here?",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Hey antisocial team, App dos'nt start after give all type of permission. Please help me",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "good idea, but the app blocker dosen't work at all! and can't even change daily limit. useless :( i will rewrite if this fixed.",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "Should be a great app, but it was buggy from the beginning. Now it doesn't open up at all \"there was a problem with configuring your applications please try again\".",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "The app does not start or monitor my useage at all.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Great app, provides a heap of information on phone usage patterns, needs a few adjustments like the blocking apps and scheduling phone free time",
    "themes": [
      "Statistics",
      "Add Features"
    ]
  },
  {
    "review_description": "This is draining too much battery .",
    "themes": [
      "Performance"
    ]
  },
  {
    "review_description": "This app is very useful to people that wanna reduce use of cellphone.",
    "themes": [
      "Addiction",
      "Impulse Control"
    ]
  },
  {
    "review_description": "Very useful for those who want to spend less time on the phone.",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "It might work for other people but it kept telling me someone else was using my phone and asking why I wasn't! It was me using it! It was me!!",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "How can we create friends group who are also using this app and compare usage with each other ???",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Great app to let you monitor/control your time on social media and other apps",
    "themes": [
      "Statistics",
      "Time Management"
    ]
  },
  {
    "review_description": "Very useful in managing my time",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "Works perfectly to block apps after a self-service limit.",
    "themes": [
      "Self Monitoring",
      "Timers & Blockers"
    ]
  },
  {
    "review_description": "Love it so far, keeps my sm use in check",
    "themes": [
      "Self Monitoring",
      "Time Management",
      "Impulse Control"
    ]
  },
  {
    "review_description": "Great for helping me see where my time is wasted! A definite motivator to be more productive. I wish I could change the time the day resets. I go to bed after midnight and I don't consider that a \"new day\" yet. I also wish I could set different daily limit based on the day of the week. The schedu...\nFull Review",
    "themes": [
      "Productivity",
      "Self Monitoring",
      "Awareness",
      "Add Features"
    ]
  },
  {
    "review_description": "Amazing app!! It has helped me and my SO get off our phones when we are together aswell as apart, challenging us to compete against each other everyday to plant the most trees! Bought the premium version straight away and my SO loves the ability to plant real trees; it's a great initiative. A fe...\nFull Review",
    "themes": [
      "Rewards & Motivation"
    ]
  },
  {
    "review_description": "I love the app and how it forces me to focus. However, the trees/bushes in the shop are too expensive for the 1x week user who won't spend money on the app. Cool concept, I'm glad there's an impact in the real world with tree planting, and i understand the need for funding. I believe more users ...\nFull Review",
    "themes": [
      "Productivity",
      "Rewards & Motivation",
      "Focus"
    ]
  },
  {
    "review_description": "I use forest daily for my study sessions, but noticed recently i'm not able to access my notes (mobile gallery) during planting session even after whitelisting system apps & gallery. I was able to whitelist apps before but now it says go back to forest immediately when pressing home button. Pleas...\nFull Review",
    "themes": [
      "Studying"
    ]
  },
  {
    "review_description": "OH MY GOD! FORESTAPP PEOPLE IF YOU ARE LISTENING! I HAVE AN IDEA!!!! What if you, in addition to the timer mode, had a STOPWATCH MODE for forest?? Like, how long can we go for without touching our phones??? And the tree could grow from a baby bush into a big 120-minute tree. And when you quit th...\nFull Review",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "This is a great app to become more productive. A must have! The thought of killing a tree, even a virtual one drastically changes how I think about work. The only drawback is that this app doesn't have a widget. Widget would make it so much more easier to use this app. Please add widget soon. Fl...\nFull Review",
    "themes": [
      "Productivity",
      "Add Features"
    ]
  },
  {
    "review_description": "Umm, most of it I loved. I did everything It's supposed to do. Mainly. I may be wrong but at the start I'm pretty sure it said we were allowed to chat with people yet when tried I it said go back to the app your trees Gonna die. I also tried to use my notes and it didn't work. I love the app but...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Unfortunately does the app not work on my mobilephone Lenny 5 (from Wiko). It's Android 8.1. The function \"planting a new tree\" does not work properly. I get a notification saying: Do not disturb access; This feature is not availible on this device.\" Please fix this issue. Thank you for your tim...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It is good and all but it's not The synchronization feature is lacking. I can't synchronize whitelists blacklists between different computers on the chrome add on, I can't start growing a tree at all devices simultaneously. I also can't access settings while a tree is growing so if I need to use ...\nFull Review",
    "themes": [
      "Other Devices"
    ]
  },
  {
    "review_description": "I've wasted like 10 minutes trying to get the settings right on this app. The default settings were not helpful at all. I could use the phone while my tree was growing, which seems besides the point. The settings menu descriptions were confusing. And I had to change all these permissions. I thin...\nFull Review",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "Achievement, pretty icons and planting a REAL TREE are great incentives. Fun and easy to use. Well invested money. Only thing missing is something like a reminder or the option to add some min per day that surely happened but were not tracked - after all the purpose of this app is to get you OFF ...\nFull Review",
    "themes": [
      "Rewards & Motivation",
      "Add Features"
    ]
  },
  {
    "review_description": "I can't get past the first screen? I set my time and then click \"plant\" and it brings me to a \"Do Not Disturb access\" page, and no matter what I do there there's no move forward button or anything, no way for me to access the actual tree growing part of the app. I'm hugely disappointed, is there ...\nFull Review",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "I loved this app. Helped me get off my phone for hours at a stretch. Helped restore my sleep cycle as well. But there are some inbuilt apps like YouTube which can still be accessed when planting trees on forest. How to stop access to those inbuilt apps?",
    "themes": [
      "Impulse Control",
      "Sleeping"
    ]
  },
  {
    "review_description": "I really like this app. I really get motivated to keep my trees alive when I turn it on. I put it on often for even short periods of time, otherwise I feel like I'm on my phone too much. My only gripe is that when I want to double my coins, the ads don't load 50% of the time.",
    "themes": [
      "Rewards & Motivation",
      "Metaphor"
    ]
  },
  {
    "review_description": "There's no use of this app to me if the 'Plant Reminder' function doesn't work. It only vibrates and that too only once. No sound of notification although it has been set to 'sound'. Many times there's no notification at all inspite of a reminder being planted. Please fix this. Also increase the ...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Love the app and use it daily. However I have problems with the trees I unlocked. Only the tree appears without the bird/flowers. I unlocked them because of the birds & flowers but yet they aren't there? That's disappointing.",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "I really like this app, and have been using it all day. My only problem (which I'm sure is a personal eror) is that my tree keeps dying when I use function apps (like messanger or cozi). Outside of this the app is great, and is really cute.",
    "themes": [
      "Rewards & Motivation"
    ]
  },
  {
    "review_description": "I totally love it. It helps me focus with my studies but somehow if I leave the app it doesn't notify me and the timer still is on and the plant did not die. Is this a problem with the app or my phone? I downloaded it because it was totally recommended for me. Hope you fix that bugs thank you😊",
    "themes": [
      "Productivity",
      "Studying",
      "Focus"
    ]
  },
  {
    "review_description": "This is a great app for just putting the phone down. The more trees you plant the more points you get and you can use points to buy different sorts of trees. It's great because it works like a phone game, but it's a phone game that gives you time rather than taking it away. I appreciate this app ...\nFull Review",
    "themes": [
      "Impulse Control",
      "Rewards & Motivation"
    ]
  },
  {
    "review_description": "I love the Work you have done, I have a suggestion to your work please do add some new sentences which will keep us focused for a longer duration. What is happening right now that after few days you can predict what would be the next sentence to keep us focused on to the job. You have done an aw...\nFull Review",
    "themes": [
      "Add Features",
      "Focus"
    ]
  },
  {
    "review_description": "Amazing app!! However, there seem to be bug issues with the phone screen time tracking; one day it would say I spent 3 total hours on my phone but when I go back to look at it the next day it would say i spent only 2 minutes",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I really think it was so effective!! It really pushed me to work harder every day, with just the idea of a tree. I really recommend this app for people who are busy or people who are not but want to be productive. In any case the app is for everyone out there!!",
    "themes": [
      "Rewards & Motivation",
      "Productivity"
    ]
  },
  {
    "review_description": "I like this app a lot with a significant exception: The notifications for group invites completely fail to work. While they appear in the notifications list, clicking them does nothing. Going into the so shows no pending invites. I have to get the code from my teammate in other ways.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Its good at what it does. My one complaint is that your forest only lasts a day. I would like it better if it lasted a week or a month so you could see some progress",
    "themes": [
      "Detailing"
    ]
  },
  {
    "review_description": "( old review= It does what it's supposed to Do, and is fairly good altogether. Though I do wish you could still receive calls (at at least have the option of receiving them) as the calls could be important family emergencies or even your boss.) I do like it and it really helps, but I was you cou...\nFull Review",
    "themes": [
      "Restrictive"
    ]
  },
  {
    "review_description": "It is great. Though there are some glitches where the octopus tree and triplets are on the same page. Also, sometimes the tree only grows to baby form and will only grow into adult after a long time then when it is in the forest, there is now adult form.",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "An amazing app, the app is helping me a lot to foucs on my tasks and I have paid to get the premium version and it definitely worth it. I have given the app 4 Stars instead of 5 because there's one feature I think this app is missing and I would love to see it on the app sometimes soon, The futur...\nFull Review",
    "themes": [
      "Productivity",
      "Add Features"
    ]
  },
  {
    "review_description": "There is a glitch. Right now the app is open, tree is alive, but I am using other apps simultaneously.. I exited quite easily when I accidentally clicked the button in the bottom centre!! That's not good😅😅😅 Please fix the bug.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "App is good. Very good actually. But the maximum time i can set is 2 hours which I did not like. We should be able to set timer as we like. Because sometimes after 2 hours I get disturbed instead of focussing on my study by timer. I want to set timer for longer duration.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Amazing app for fone addict's. It has an option of whitelist, where you can remove those you frequently go visit and on forest mode.... Plant lovers will never loose their focus...",
    "themes": [
      "Addiction",
      "Productivity",
      "Rewards & Motivation",
      "Metaphor",
      "Focus"
    ]
  },
  {
    "review_description": "Great apps! I am into it since first try. Only 1 thing I found out is it would be to have other apps using opt (something i am focusing on working that need to open files i save in the phone, reminder, dict etc..)",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "I love this app. Helped me complete some creative projects. Only thing is I had to upgrade my phone and lost all the trees I had unlocked and my history. Is there a way for me to get that back?",
    "themes": [
      "Productivity"
    ]
  },
  {
    "review_description": "Edit: thanks the developer for the answer regarding break sessions. I find this a perfect productivity app now. (Previous: I use this app to record my pomodoro sessions. I just wish that the timer can be set to 5 minutes to record the pomodoro breaks.)",
    "themes": [
      "Productivity"
    ]
  },
  {
    "review_description": "Love Forest! However, the video ads that double your points keep saying that they're unable to load, and then the page gets stuck and I have to restart the app. Otherwise it's wonderful",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I really enjoyed using Forest prior to the last few updates. The newer versions are simply geared toward the developer making money. It seems like they lowered the amount of coins you got per tree so they could push the option to buy boosters. I was also forced to delete a my old data in order f...\nFull Review",
    "themes": [
      "Price"
    ]
  },
  {
    "review_description": "Great but since I only earn 3 coins a Bush, it's really hard to save up for 500. I've been using this app for over a year now but only have around a hundred coins. No hate though. Overall, I love this app and recamend it.",
    "themes": [
      "Rewards & Motivation"
    ]
  },
  {
    "review_description": "I would love it if it didn't bring me to a 'do not disturb access' page every time I press plant. I can't get past it and what does it mean? I haven't been able to plant a single tree yet. Please get back to me.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Awesome! Broke my addiction. I was a loser before this, now I use this app to just... CHILL. I love that are very few ads, and the coin feature, well, that's just what keeps me going. Keep it up, forestapp.cc!",
    "themes": [
      "Addiction",
      "Feeling Better",
      "Rewards & Motivation"
    ]
  },
  {
    "review_description": "I love using this app! It allows me to be productive! However, I have been having an issue lately. Whenever I try to purchase a Box of Sunshime Elixir, the app would always close. Please help fix the issue.",
    "themes": [
      "Productivity",
      "Bugs"
    ]
  },
  {
    "review_description": "I loved the app and the idea of it but once i started using it it didnt work. Every time i would plant a tree my screensaver would turn on and the tree would die",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "This app has literally probably saved my grades, a lot of my friends use it so buying it was worth because it motivated me to beat my friends hours of study and grow lots of forests. I really like how it doesn't allow you to buy coins and you can only earn them but I'd definitely recommend the fu...\nFull Review",
    "themes": [
      "Studying",
      "Self Monitoring",
      "Rewards & Motivation"
    ]
  },
  {
    "review_description": "Good app, but when the additional trees cost 500 coins and up I really need that rewarding ad that doubles my coins. It stopped working, please fix it.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I love the idea of this app. However, it keeps killing my trees and says because I gave up, while I haven't even touched my phone.",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "Excellent for me, since I have a very kind heart to trees and plants 🌲. So I wouldn't open any other app while studying to kill that tree! Love it..Thanks to the developer :)",
    "themes": [
      "Metaphor",
      "Studying"
    ]
  },
  {
    "review_description": "Terrible! It keeps sound an alarm to go back to the app, even though I'm not using any other apps.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "The app is better than I remembered it. The only feature I would like to see is the ability to zoom in on your forest. The art is nice, it's a shame I can't see the forest closer (I can barely see the bench near the tree). Apart from that, the app is great, it has improved nicely since I last use...\nFull Review",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Nice app but I'd like to see some additional features, for example if like the app to automatically detect when in a moving vehicle and activate (other apps do this to silence notifications but I'd like to build trees too!). Also if setting for 60 minutes, and then actually away from your phone ...\nFull Review",
    "themes": [
      "Add Features",
      "Unplug"
    ]
  },
  {
    "review_description": "Needs to offer options longer than 2 hours! Or at least vibrate when the 2 hours are up! A total amount of time focused would also be great. A computer program would be useful",
    "themes": [
      "Add Features",
      "Other Devices"
    ]
  },
  {
    "review_description": "This is fantastic app when it works. Unfortunately, it's unreliable. When it works it's very effective and does a good job of helping you be mindful of your usage and, since it's tunable, manage you usage effectively. I would give this five stars and buy the pro version IF it provided an accurat...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "This app used to be pretty good, but the last update removed the ability to see a long-term graph of your progress unless you pay £2.89 for the premium version. Removing key features from existing users is really frustrating behaviour from the developers. I was considering paying for SPACE Pro b...\nFull Review",
    "themes": [
      "Statistics"
    ]
  },
  {
    "review_description": "I paid for the premium version and I am very disappointed with what I get. The concept of the app is fine, but the usage in the Home tab is totally different from the reported progress, the latter is always higher than the former. I think the daily progress does not exclude the usage by the 10 e...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Very useful in making you self-aware of your phone consumption, which a lot of us can cut down on. Allows you to make realistic goals with your device usage, and adhere to them. Easily paused when you are doing something useful like perhaps using a meditation app, or browsing the web for useful ...\nFull Review",
    "themes": [
      "Self Monitoring",
      "Awareness"
    ]
  },
  {
    "review_description": "It's a really good app for it's use. Only thing that is frustrating is how watching Netflix becomes part of my phone usage statistics if i forget to lock the phone while watching. If I do lock it, I need to unlock every time I want to pause...",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "It makes you aware of your habits and of how much you use your phone. I set a reminder so that it lets me know when i have used it for 15 minutes on end. So i can take a break. It is hard though to stay within the limits but this app sure helps.",
    "themes": [
      "Self Monitoring",
      "Statistics",
      "Timers & Blockers",
      "Awareness"
    ]
  },
  {
    "review_description": "Would be a great app but it doesn't work. Doesn't give me the pop up when I unlocked my phone, doesn't stop me after 12 minutes like I set it to, doesn't track the time. Some days it kinda works some days it doesn't. Waiting for an update because it would be very useful if it works",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I have found value in this app simce installing it a few weeks ago. I am hoping that after a few months of use, i will no longer need the app to remind me to be more deliberate in the use of my phone.",
    "themes": [
      "Self Monitoring",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "Didn't listen to my ignore app rules.. Counted all my streaming music time instead of actual phone browsing. Became useless because of this.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Nags you to go live your life. And for me, that's the reason I downloaded this app. Shocking the amount of life I waste on my phone. Doing things like rating apps...",
    "themes": [
      "Self Monitoring",
      "Addiction"
    ]
  },
  {
    "review_description": "Quite good to show to you how much you might be addicted to ur phone. I like the part where it shows the time spent on each app and you can really get a sense of where exactly do u waste ur time !",
    "themes": [
      "Addiction",
      "Statistics"
    ]
  },
  {
    "review_description": "Pros Bestest ever to break your addicted corresponding to phone You get focus automatically because u didn't get any notification Cons Sometimes it shows notification even u r set to blocked notification.. I don't know y i m using in Redmi note 4 ..ut maybe happen that android os notification au...\nFull Review",
    "themes": [
      "Addiction",
      "Focus"
    ]
  },
  {
    "review_description": "kudos to the team as the app as improved much since it's launch, but the only thing that I still miss is the motivational quotes it interrupted me with, hope they will look into this.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "OMG, they took out the program's period graph. Now you can only see one week at a time. so now i'm going to take out SPACE fro my phone tas well.",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "If you want to cut down on your phone addiction this is the app for you. Give it a try.",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "Redic. Does not work. Told me I had 2 days when I hadn't used phone at all, know for a fact that was wrong. What's the point of it?",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "This app works wellness I have used my phone more thoughtfully than before and I spend more time being present. I have had it one week now and have read three books in the spare time that Space has revealed to me.",
    "themes": [
      "Free Time",
      "Time Management"
    ]
  },
  {
    "review_description": "Irritating but that's the good part right, you want your phone addiction gone so this app repeatedly irritates you and make you not dwell on phone.",
    "themes": [
      "Addiction",
      "Irritating"
    ]
  },
  {
    "review_description": "I wish it had more detailed breakdowns of usage, but it's very effective at keeping me mindful of how I'm sending time on my phone. I've received that time quite a bit.",
    "themes": [
      "Detailing",
      "Statistics",
      "Time Management",
      "Awareness"
    ]
  },
  {
    "review_description": "In zenfone 5 unlock interrupt is not working, when you say it's important it locks the phone anyway",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "This is a good app for being focused on our goals. It helped me being more productive and less addicted to the virtual world of internet.",
    "themes": [
      "Focus",
      "Productivity",
      "Awareness"
    ]
  },
  {
    "review_description": "Blocking notifications doesn't work very well. They are not archived, so there's no way of knowing what you missed. The \"missed notifications\" section just tells you the app and how many. I have 10 missed notifications from the clock, and I can't figure out what they are.",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "space is fantastic! you have no idea how much time you are on your phone until you can see it in a consistent fashion. I recommend space to anyone who feels to attached to their phone.",
    "themes": [
      "Statistics",
      "Awareness",
      "Impulse Control"
    ]
  },
  {
    "review_description": "it won't work. the time tracker, the pop ups. it just worked for a few minutes after I installed it. and also it's not accurate. I'm seeking for this kind of app actually, so I like this app, but just when it works. I hope you can fix it, and I'm waiting for the next update.",
    "themes": [
      "Bugs",
      "Good Idea"
    ]
  },
  {
    "review_description": "It helps to monitor your phone usage, and reminds me not to use more than required. It's good when you decide to break phone addiction",
    "themes": [
      "Self Monitoring",
      "Addiction"
    ]
  },
  {
    "review_description": "Great for helping me unplug and look away from my phone! A breath of fresh air that's exactly what I was looking for :)",
    "themes": [
      "Unplug"
    ]
  },
  {
    "review_description": "It would be nice if there was something more on the home screen. Other than that, this app is awesome",
    "themes": [
      "Detailing"
    ]
  },
  {
    "review_description": "It's cool. I mean i used to use my phone for a minimum of 5 hrs. Now it's just 30 mins.",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "Great app. I love the aesthetic. It's a really great way to track your usage. I wish They didn't make you pay to block out more than five apps thought. But besides that It's good.",
    "themes": [
      "Statistics"
    ]
  },
  {
    "review_description": "The only problem I have is when I get a notification midway through a Live video. Everything else is helpful.",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "I can see now that my phone usage is not excessive, still this app helps me when I'm forgetting time to bring me back to the real world. Hsppy to have it on my phone",
    "themes": [
      "Unplug",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "It definitely helps, I wish they could reward you a little bit more for accomplishing your goals, or punish you if you didn't.",
    "themes": [
      "Add Features",
      "Permissive"
    ]
  },
  {
    "review_description": "This app has been tremendous in helping me lessen the amount of time I spend on my phone. Down to less than 2 hours which for me is big. Cheers to SPACE",
    "themes": [
      "Statistics",
      "Time Management"
    ]
  },
  {
    "review_description": "Keeps coming up when I am navigating in the car. Infuriating. Uninstall. It needs to be smarter.",
    "themes": [
      "Irritating"
    ]
  },
  {
    "review_description": "I like the guilt trips, they keep me on my toes",
    "themes": [
      "Feeling Better"
    ]
  },
  {
    "review_description": "It nags you to use your phone less",
    "themes": [
      "Impulse Control"
    ]
  },
  {
    "review_description": "Used to be a good app as it interrupted you when you unlocked. Now it waiting until you lock too many times before it does anything. Uninstalling",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Great system, even though I end up ignoring most of them.",
    "themes": [
      "Ignorable"
    ]
  },
  {
    "review_description": "Not working with my Redmi note 5 pro. Unlocks and time both reading not changing. Fixed at 0. Please help",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Not cool to remove functionality from the free version and then offer it back under the paid version.",
    "themes": [
      "Price"
    ]
  },
  {
    "review_description": "I love it! Awesome and works as it should. Though takes time to understand the inner workings of the app..",
    "themes": [
      "Statistics",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "It resets the time spent on the phone constantly. I really can't figure out why",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "This app is perfect for people who want to curb the amount of time they spend on their phone",
    "themes": [
      "Time Management",
      "Statistics"
    ]
  },
  {
    "review_description": "Nice app to track your daily usage",
    "themes": [
      "Self Monitoring",
      "Statistics"
    ]
  },
  {
    "review_description": "Very helpful in helping to get you to stay off your phone and in the real world.",
    "themes": [
      "Unplug"
    ]
  },
  {
    "review_description": "Helped me to rein in cell phone usage",
    "themes": [
      "Self Monitoring",
      "Impulse Control"
    ]
  },
  {
    "review_description": "Helps me keep better track of time spent on my phone.",
    "themes": [
      "Self Monitoring",
      "Statistics"
    ]
  },
  {
    "review_description": "Great to help break phone habits",
    "themes": [
      "Impulse Control",
      "Break Habits"
    ]
  },
  {
    "review_description": "Works well on my phone, and is very helpful for getting to sleep and discussing on studying. There was a way to close it in settings, but that got patched by disallowing opening settings (I think that's optional). Scheduling a time period that crosses over midnight used to cause it to randomly star...\nFull Review",
    "themes": [
      "Sleeping",
      "Studying"
    ]
  },
  {
    "review_description": "Overall, the concept of the app's timer is useful and effective. However, I believe the phone usage time-tracking feature needs quite a bit reworking. Even if my phone is turned off and unused the entire time, if I receive a text message that I don't open until 6 hours later OFFTIME will record it a...\nFull Review",
    "themes": [
      "Timers & Blockers"
    ]
  },
  {
    "review_description": "I love this app but there are some issues with it. Specially when it comes closing apps that I whitelisted. For example It tends to close some of the phone settings even when I whitelist it. I feel like this app would work better if it show all the apps and documents in the system and allowed you to...\nFull Review",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "Sent bug issue few months ago about scheduled calendar repeating its loop day when deleted, acting as if it weren't. I love the app but the fact this still is not fixed, nor the fact I had no reply to my mail is unsatisfying for someone who paid for the pro version and wanted to donate more.",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "Love it. Didnt work for the first day or two. Now it works great. Haven't found any way to work around it. (Even restarting my phone or changing the time in my phone). Love the scheduling, the ability to block everything but texts and calls. Also love the ability to send automatic text messages t...\nFull Review",
    "themes": [
      "Timers & Blockers",
      "Timers & Blockers"
    ]
  },
  {
    "review_description": "Rarely write app reviews but this app is worthy of attention. The overall concept is great, and the features generally works well. Just one thing missing. When whitelisting apps, some system apps does not appear on the selection list. i.e. having issues when trying to change my settings and rece...\nFull Review",
    "themes": [
      "Good Idea"
    ]
  },
  {
    "review_description": "I've tried all the main distraction blocking apps, and I keep coming back to off time. I only need to be blocked from the internet ( I REALLY NEED to be blocked from the internet and reading news), but I also need access to all the other functionality of my phone. Offtime lets me make and receive ca...\nFull Review",
    "themes": [
      "Timers & Blockers",
      "Unrestrictive"
    ]
  },
  {
    "review_description": "Why does it need me to re-approve the permission access every fricking day?? It's not because of updates, I turned off auto updates so I do it manually and know it hasn't been updated on these days yet it still loses my permissions all the time. Why. Worked fine until I upgraded to full version, no...\nFull Review",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "DUDE the power saving function of phone closes the app and app then stays closed. No auto start happens. Kindly help. Maybe this is a bug. EDIT : If you're not not gonna interact with your consumers how do you think you can sustain this app ? I have paid for your app and find headache in communicati...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "The app works fine for it's purpose but It has a lot of bugs. And the one that bothered me worst is with schedule. Schedule is premium, so if you want to use it you have to pay for it. I did. But now it glitches every time I want to use it and the one reason why I spent money on this app now I c...\nFull Review",
    "themes": [
      "Bugs",
      "Price"
    ]
  },
  {
    "review_description": "I changed my review from 5 stars to two because increasingly, all the 'behind the scenes', connective apps are being stopped as 'not allowed apps' and there is no setting I can either change in the app (profiles for example) or on my phone to remedy this. I end up having to turn off this app dai...\nFull Review",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Its a good app but it will be amazing if it does one new update. The thing is it isn't harder for me to stop the profile. So why don't you make it necessary to touch the screen for a minute or 2 so that it becomes harder for anyone to stop it. Because all those who have installed it are those who ar...\nFull Review",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "I have been using it for a while but I'm not getting the access of pro.. I cant buy the version so if u could provide me with the code.. I would surely look forward for the same.. The app is simply amazing and it helps me in focusing on my work.. Thanks for ths wonderful app",
    "themes": [
      "Focus",
      "Working"
    ]
  },
  {
    "review_description": "After I updated my device this app stopped working. Earlier I was able to block settings but now I can easily open it and uninstall the app. Would love to see an update that actually stops me from uninstalling the app. I rated it five starts before but am changing it now to one star until the issue ...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I really enjoy this app. Simple, useful, effective. It helps me stay off of YouTube and Facebook, and in result I have way more time to do offline things like garden work or drawing. Highly suggest to anyone trying to wane unnecessary phone time, while being able to use the apps I need.",
    "themes": [
      "Easy to Use",
      "Unplug",
      "Free Time",
      "Time Management"
    ]
  },
  {
    "review_description": "A very good tool if you have very less self-control like me and you need make a habit of studying for long hours without distractions... Only thing is that it makes the phone switch to silent mode and i missed some imp calls... Hope there is manual setting for it in future.",
    "themes": [
      "Self Monitoring",
      "Studying"
    ]
  },
  {
    "review_description": "Hii guys i am using this app to focus on my study. When i started using this app it was also running in background if it closed and it still block app vut after 2 days it not working properly. If i close the app but timer is still going in too bar it show it still block app but it is not working",
    "themes": [
      "Focus",
      "Studying"
    ]
  },
  {
    "review_description": "I love this app it's great for helping me switch off. I've got one issue i can't resolve which is its blocking my phone calls in and not allowing me to access the keypad even though I have not set that. Still having problems with being able to get to my keypad on a phone call.",
    "themes": [
      "Unplug",
      "Bugs"
    ]
  },
  {
    "review_description": "Useless app. I created a schedule to block some apps in my sleep profile which is not working at all, doing nothing on scheduled time. Trying to create an account, and whatever email I provide it says account already created. And throwing error while recovering password for account that was somehow ...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I love this app, it was the best small investment I made in a long time. It allows me to block all the distracting apps and also schedule blocks. It has saved me time and my productivity is higher. I also love that you can make it easy, hard or impossible to unblock once you start or schedule a bloc...\nFull Review",
    "themes": [
      "Timers & Blockers",
      "Productivity"
    ]
  },
  {
    "review_description": "This app was recommended to me by one of my University professors and has always helped me to stay focused, and to be more productive. It is difficult to sneak around the restrictions, and the warnings are comical. I appreciate the time I have enjoyed away from my phone thanks to this app.",
    "themes": [
      "Focus",
      "Time Management"
    ]
  },
  {
    "review_description": "This app is just short of a five star review. My only gripe is that the app just won't block me from opening my phone's settings. If I open the settings I can easily override the app blocking feature (which for me is very tempting). Besides that the app is great.",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "Only reason this doesn't get 5 stars is because whenever an \"off time\" session finishes, it turns my volume on. No. I keep it on silent. This irritates me more than is reasonable. But actually it's a good app. Helps break me of my habit to grab my phone and distract myself.",
    "themes": [
      "Impulse Control"
    ]
  },
  {
    "review_description": "I love how it's strict and there's no way to uninstall. However I often need to make phone calls and it doesn't let me access the call page even though the phone app is unlocked. I need to press numbers during calls sometimes. Please fix it and I'll change my review! I'm using a Samsung galaxy s7.",
    "themes": [
      "Restrictive"
    ]
  },
  {
    "review_description": "Love at first sight, really! Let's me use the apps I need and shows me sassy responses when I try to access apps I have blocked. Shared it with all my friends, we really need this for finals. It's a pity I haven't come across this sooner",
    "themes": [
      "Timers & Blockers"
    ]
  },
  {
    "review_description": "Good concept to unplug our device and also it is very useful for me to focus me on my studies. There is a problem when I close the app while it's working i easily open any app and do anything with my phone plzz fix bugs. I request developer to give an option to unable stop profile when our devic...\nFull Review",
    "themes": [
      "Unplug",
      "Focus",
      "Studying"
    ]
  },
  {
    "review_description": "Really loved this app.. had a thought of cutting my own hand for using social networking sites!.. whenever I try to access those site 'Offtime' came up with most funny push-up notification.. good work 👍",
    "themes": [
      "Impulse Control"
    ]
  },
  {
    "review_description": "I have set multiple schedules with different profiles but unless I exit the activity insight at the end of a schedule, it doesn't automatically start the another one. It is very bothersome since I paid to use schedules mainly and none of the tracking methods work. They have one job, that is, to s...\nFull Review",
    "themes": [
      "Bugs",
      "Price"
    ]
  },
  {
    "review_description": "I can't uninstall the app. It kept asking me to make it a device administrator, and so I did, to try to prevent those constant notifications. However, I now cannot stop it from being a device administrator, as settings always crashes when I try to do that, and I can't uninstall it until I stop it fr...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I like this app. Rated it 2 * for ur attention. I have an issue. I have 2 phones configured with same Google profile. I purchased pro on one phone. Should I buy pro for another phone as well. When I try to purchase from 2nd phone, I get an error saying I have already purchased this. What should I...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "LOVE this app. Thank you so much. However, could you please make a 1x1 widget? The widget available is great but takes up way too much unnecessary space. It should definitely be able to fit in a 1x2 but I would like even a 1x1. Or even both! I am a premium user and I would really love this!!",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "The app worked well until both the schedule thing crashed the app when opened and that the timer on my profile resets (for ex. the clock o will change to 5 starsn the off time runs out, then it resets to 24 hours.) There isnt much I can do to fix this because the profile that loops blocks pretty...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Nice idea but needs improvements 1. Close it from the recently used apps tab and it stops functioning 2. Lock and on next unlock of my phone can access even the restricted apps 3. Since it is not active always it doesn't calculate the time of phone usage correctly",
    "themes": [
      "Good Idea",
      "Add Features"
    ]
  },
  {
    "review_description": "The thing is that I am using this app on redmi 3s prime and the problem that I am facing is I can just press the recent apps button swap and away this app and everything is back to normal again. All the profiles go in vain. Please fix it. Overall the app is good but this is a major issue. If it can ...\nFull Review",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "I paid for pro subscription via Google pay option and amount was deducted from my account but pro hasn't been activated. I also mail you about this but you guys seem really unprofessional. When I click on schedule option it ask me to buy pro version which I had done already. Please solve this proble...\nFull Review",
    "themes": [
      "Bugs",
      "Price"
    ]
  },
  {
    "review_description": "Bug 1) We can easily bypass by restarting the phone. Bug 2) Go to settings and force stop the app and BOOM! No more restrictions. Seriously?? What's the point then? I really liked the idea of the app. Please fix these problems.",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "Great concept. Except it's very buggy. I bought the pro version only to find it won't auto-reply to missed calls, and also doesn't allow calls through - as it is supposed to do. Which makes it useless for my needs. It also seems it is no longer being supported.",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "I loved this app but since I made the upgrade from Android 7.0 Nougat to Android 8.0 Oreo on my Samsung Galaxy S8 it won't block any of my chosen apps anymore. (IT DID WORK ON NOUGAT BUT NOT ON OREO!) I am going to uninstall this app because this problem is just intolerable right now. Please releas...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It worked fine for short duration of time. But during longer hours it failed to prevent the use of other applications. You need to restart the app when you unlock your phone after long period of time",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I really want to like this app as it has great features but it keeps kicking me back to my name entry screen and I have to keep starting over & over. Cannot input to set up this app. Frustrating!! UPDATE: I struggled through many repeats of setting up this app. It took some time, using permutations...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "This app has really helped me to concentrate. It's very customizable. It can be as strict or lenient as you need it to be. If I need to use my phone more I can adjust it as much as I need to then switch back if I feel like I'm using it too much.",
    "themes": [
      "Focus"
    ]
  },
  {
    "review_description": "It doesn't block phone settings so you can change the time of your phone and offtime I'd stopped. So then app become useless. Block settings also",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "It's a very useful app. But some apps that I try to put in the important (to be kept working) list, are still being blocked when I start the offtime. Like whatsapp- I need it for work. So I removed it from the block list but I am still unable to open it when offtime is working.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I like the basic idea and the interface is reasonably well designed. However, it does seem to have some BAD bugs. First, it blocks calls and texts (all of them) when I have it set NOT to block calls or texts. I tried to fix this by adding my entire contacts list to the whitelist, and setting Offtime...\nFull Review",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "Bought the pro version. Here are the issues im having. Ive given enable admin perm to app so cant be uninstalled. But when i use android task mgr to quickly close apps even this app gets closed and stops blocking apps. Ive turned on schedule but it doesnt turn on automatically unless i open n close ...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Excellent! I have a profile set to automatically prevent view of distracting apps midnight till 9am which helps me tremendously if I'm being sucked into a Netflix series or online dating Quora etc at night...poof it disappears from the foreground and a silly message is displayed reminding me to sta...\nFull Review",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "I really like the app. I am in grad school and for someone that procrastinates more than I should through my phone I decided to find an app. I've only used it a couple of times but its helping me break annoying habits. After a week, I'm going to consider purchasing the pro. The only thing I wish thi...\nFull Review",
    "themes": [
      "Studying",
      "Break Habits"
    ]
  },
  {
    "review_description": "I really love the concept of the app which made me to switch to the pro! but there are ridiculous bugs I encounter every now and then. For instance you want to block an app that waste your precious time. Bingo ! it works really well. But when the app is running O can't search app on my device or ...\nFull Review",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "V useful app.. but little rookie. Did not automatically reset the timer upon change of day. Kindly update the app regularly.. don't give up on such a useful app, I'll rate it 5 stars as soon you update and make it more stable and user friendly. Thanks.",
    "themes": [
      "Useful"
    ]
  },
  {
    "review_description": "It has a pop up every few minutes that can't be turned off. It should at least be an option to have it just run in the background. Very annoying. I just want to be able to look at the end of the day and see how many minutes I've used my phone.",
    "themes": [
      "Intrusive"
    ]
  },
  {
    "review_description": "I like the graph of usage over the course of the day, and great that it overlays yesterday's graph for comparison. But it does not show which apps I use only how much total time used on the phone. I like that you can disable the toast (?) which pops up every 3mins because that really interrupted my ...\nFull Review",
    "themes": [
      "Statistics",
      "Detailing",
      "Add Features"
    ]
  },
  {
    "review_description": "A good and useful app, however the graphs for monthly usage are actually showing your yearly usage, and on the graph it only shows 2 months at a time, which makes it difficult to compare them. Other than that, a brilliant app.",
    "themes": [
      "Useful",
      "Statistics"
    ]
  },
  {
    "review_description": "I have no idea what the chart means... Great, this is how my time is divided among apps maybe? But what apps? What good is it if you don't know which is which?",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "Enhance the pop up timer more n give option to the people to dismiss it. Manually so that it will help them to decide where to continue or leave the phone immediately.. would definitely make this app a grand success.. plz try.. !!",
    "themes": [
      "Timers & Blockers",
      "Bypassable"
    ]
  },
  {
    "review_description": "The continuous presence of a circle in my notification area without the option to turn it off makes this app unusable for me. Also, I don't have to be reminded all the time of my smartphone usage. I want to be able to open an app an look into it.",
    "themes": [
      "Timers & Blockers",
      "Add Features"
    ]
  },
  {
    "review_description": "Great app tells the exact time, don't get auto kill like many other apps, But if monthly time used can be shown in a calendar with written how many hours phone used each day that will be awesome",
    "themes": [
      "Add Features",
      "Statistics"
    ]
  },
  {
    "review_description": "Works reliable and accurate No ads, everything is free The only minus point is, you don't see how much time, life spent on which app. Also the summary could be more detailed",
    "themes": [
      "Accurate",
      "Detailing",
      "Add Features"
    ]
  },
  {
    "review_description": "AMAZING app!!....helps me A LOT! A MUST DOWNLOAD fr ppl who waste a lot of time on their smartphones....",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "Useful, simple, direct to the point. It's a pity that the only way to export recorded days is by sending an image :\\",
    "themes": [
      "Useful",
      "Easy to Use"
    ]
  },
  {
    "review_description": "It is very useful app for me. It always alert me for how much I used up mobile. Thanks.",
    "themes": [
      "Useful",
      "Statistics"
    ]
  },
  {
    "review_description": "The app shows pop up notifications even if my usages are less than 5 minutes. Why?",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Trust me I like this app more than anything but I really don't like the less amount of stats it shows you should give data of about each day of a week to make us compare but still love it. Thanks for this.",
    "themes": [
      "Detailing"
    ]
  },
  {
    "review_description": "Thank you for making this application that doesn't encourage more time on the smartphone",
    "themes": [
      "Awareness",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "Useful app, but I wish I can add the usage statistics to home as a widget (just like the upper part of the forth photo), thanks 😉",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Please add some features to deactivate the notification if we are calling",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Need to fix the problems not showing properly",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "The app must be updated so that it can show how much time is spend on a another particular app",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Best app for making sure you limit your phone usage. I like the notification at all times that keeps track. Thanks",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "helps me in controlling over addiction",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "Good job new idea soft all tech group thanks",
    "themes": [
      "Good Idea"
    ]
  },
  {
    "review_description": "Why can't I hide the app. I don't want reminders. I want this all to be hidden while I use my phone.",
    "themes": [
      "Irritating"
    ]
  },
  {
    "review_description": "Need Some features like every app usage details and notification system development",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Nice app..with graphs that show how time we spent on mobile on daily,weekly anf on monthly basis",
    "themes": [
      "Statistics"
    ]
  },
  {
    "review_description": "Very helpfull aap ...am very happy on this app it change my habits and no wast time.",
    "themes": [
      "Useful",
      "Break Habits",
      "Time Management"
    ]
  },
  {
    "review_description": "I would like to be able to set when my day starts, as I am usually up past midnight",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Finally some control over my time",
    "themes": [
      "Time Management",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "Please add feature of disableing notification",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Very useful application for helping in improving my life by reducing phone usage.",
    "themes": [
      "Useful",
      "Impulse Control",
      "Time Management"
    ]
  },
  {
    "review_description": "I tried a couple of app blockers but didn't find what I was looking for until this one. I use it only to cap my idle scrolling on social media. Really like the little arrow on the edge of the screen when you open a blocked app... It's not too in your face, but is a light reminder that maybe you'...\nFull Review",
    "themes": [
      "Timers & Blockers"
    ]
  },
  {
    "review_description": "👆Just what I wanted, minus one thing. I wish the app had location triggers so that it would smartly lock the apps when I get to work. It could also use some other triggers (think IFTT, or Tasker). Other than that, this app works great! I really appreciate the app tracking even if you don't nece...\nFull Review",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Let me tell you, this app has single handedly changed my life. I've only been using it a week and already my productivity has increased because it will lock me out of reddit and Instagram. I'm more attentive at work, and doing my college work. That blue \"blocked\" screen always gets me 😂 I'm not ...\nFull Review",
    "themes": [
      "Productivity",
      "Timers & Blockers",
      "Working",
      "Awareness"
    ]
  },
  {
    "review_description": "Perfect app. Bought premium directly.Improved my rating to 5 because it already had the feature of blocking app for particular time. Only one suggestion: Make the blocking screen more aesthetic by increasing the font size of quote, quote text in centre, a motivational background picture, no app ...\nFull Review",
    "themes": [
      "Timers & Blockers",
      "Add Features"
    ]
  },
  {
    "review_description": "The flexibility of this app is awesome. I only have one or two problem apps (where I spend way too much time) and the rest are great uses of my phone. The ability to only restrict the problem apps (and to choose how and when I restrict them) is perfect.",
    "themes": [
      "Timers & Blockers"
    ]
  },
  {
    "review_description": "Very useful app, if you're preparing for some competitive exams. It prevents you from wasting your time on things which does not add on to your growth.",
    "themes": [
      "Studying",
      "Time Management"
    ]
  },
  {
    "review_description": "One of the best apps to block apps. I've already bought the pro version after one Day of usage. I really like statistics of the usage time and the launch of apps. And I really like that you can even block access to the system settings so you can't deactivate the device administrator. Many useful...\nFull Review",
    "themes": [
      "Timers & Blockers",
      "Statistics"
    ]
  },
  {
    "review_description": "Excellent app except for when i enable strict mode, i can just go and change the time and it will unlock. Could you add the option of the app using its own time and not syncing with system time? I need to be able to access setting so i cant enable settings block. Only the time feature would make...\nFull Review",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "Developer is a very good person. I can see this app is really strict against distractions.",
    "themes": [
      "Impulse Control"
    ]
  },
  {
    "review_description": "The smelly brown ugly app doesn't show the motivational message any more after the update (because the setting was removed). Bring back the old settings.",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "Great app for breaking the habit of consistently checking social media apps. Great for staying focused.",
    "themes": [
      "Break Habits",
      "Impulse Control",
      "Focus"
    ]
  },
  {
    "review_description": "Perfect app. No issues at all. Very professional design. Highly recommended if you are addicted to social media",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "It's just awesome. Buy the pro version and you can completely control your habits.",
    "themes": [
      "Break Habits"
    ]
  },
  {
    "review_description": "Feature Request: - Please add a feature where I can allow myself to 2mins of app access if I need it urgently, when an app is blocked.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "I think this is the right place where u can limiting u r desire..",
    "themes": [
      "Unplug"
    ]
  },
  {
    "review_description": "Essential tool. Life saving.",
    "themes": [
      "Feeling Better"
    ]
  },
  {
    "review_description": "Great for taking a mental break",
    "themes": [
      "Unplug",
      "Focus"
    ]
  },
  {
    "review_description": "This app keeps Me safe from Myself. Love it.",
    "themes": [
      "Feeling Better"
    ]
  },
  {
    "review_description": "Useful. Makes you immediately feel better",
    "themes": [
      "Feeling Better"
    ]
  },
  {
    "review_description": "Good app to control usage of mobile.",
    "themes": [
      "Statistics"
    ]
  },
  {
    "review_description": "Works. I had problems spending hours a day on Reddit and other apps. It's a good reminder that I've been on an app too long. I'm not paying for it so I can't make it strict, but as long as I don't allow myself to change the settings it's perfect.",
    "themes": [
      "Awareness",
      "Bypassable",
      "Time Management"
    ]
  },
  {
    "review_description": "I love the concept, but when you set a time limit for an app, there's an annoying little block that pops up on the left that shows the clock if you tap on it. You cannot move it and it is quite intrusive. But if you can put up with that, the app works well.",
    "themes": [
      "Good Idea",
      "Intrusive"
    ]
  },
  {
    "review_description": "The concept and options are amazing! But the app itself needs some work. I've noticed that certain apps don't even get recognized even though I use it well past the set times. Like manga rock or even Google chrome.. Hope you fix it soon thabks!",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "Pretty good and effective app blocker. It has a few weaknesses, though. 1) The process of creating new block rules and profiles is somewhat confusing. 2) Time-based restrictions can easily be circumvented by changing the time in the phone settings. That's why this app is only effective if you enable...\nFull Review",
    "themes": [
      "Timers & Blockers",
      "Bypassable"
    ]
  },
  {
    "review_description": "This app is very nice I really love this app first of all it helps me in my exams I just lock the apps add a strict layer for which I had to pay only 200 rupees which is so cheap for 1 month. It can just help you out when you are addicted for certain app this has helped me because it just avoids ...\nFull Review",
    "themes": [
      "Studying",
      "Addiction"
    ]
  },
  {
    "review_description": "It was a great app (my previous reviews), but now it's getting updates every third day, and after every updates it requires to be activated manually. The password to this app is with my wife, every third day I'm asking her to lock this is like an annoying experience.. not useful anymore.. thinki...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Please let me know if can block usage of package installer. If i will still be allowed to install new apps, after blocking existing apps, there will not be much use of this app for me. I will be tempted to use locked app features in new new app",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "So far so good! It would have gotten 5 stars however, even though I opted to block notifications, that feature is not working. That's my only complaint thus far.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Love it! It has a few quirks, but overall great! I love how it even tells you how much time you have spent on a app by day, week or month! Goodbye to wasting time on facebook!",
    "themes": [
      "Awareness",
      "Statistics",
      "Time Management"
    ]
  },
  {
    "review_description": "I had an issue, and the developer responded immediately with a solution. This app is great, and I have it on my computer, too. Gives me the space to break my nighttime habit and actually sleep!",
    "themes": [
      "Other Devices",
      "Break Habits",
      "Sleeping"
    ]
  },
  {
    "review_description": "I really like the idea of the app and it seems that when it works it works really well. But for my own phone I was unable to find a way to turn on the function of having the app start when the phone starts. This may seem like a small gripe but it essentially makes the app useless as you have to ...\nFull Review",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "So this app is the best productivity app of all the apps I've tried. The only downfall is for a split second I'm able to see my text messages before it blocks it. Other than that it's great though",
    "themes": [
      "Productivity"
    ]
  },
  {
    "review_description": "So I can't delete the app, can't get out of strict mode, and no have no access to settings. No Bluetooth. No hotspot. No wifi. Totally stuck and support has not replied.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Really loving having the block on social media. I put it on emails too because I can obsessively check them all day long - and it lets you get a quick glimpse of the open inbox before it shuts you out - kind of helpful actually because if something urgent is visible I can see it and go deal with...\nFull Review",
    "themes": [
      "Timers & Blockers",
      "Impulse Control"
    ]
  },
  {
    "review_description": "Doesn't work! I blocked an app but was still able to launch the blocked app.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "At first I was amazed at this app, but then literally just a day later it was not telling me how much usage I have done and not telling to stop using like it was doing before and all the functions are really so complicated u dont understand what to do (usage time, specific intervals, quick block,...\nFull Review",
    "themes": [
      "Bugs",
      "Design Flaws"
    ]
  },
  {
    "review_description": "Great apps! but I have a question. Can you block the \"pause\" menu when you are using strict mode? Thank you! EDIT: I paid for the pro version. actually I did that months ago. editing my comment just to let everybody know that this app indeed worths my money! :) kudos for the dev team!",
    "themes": [
      "Timers & Blockers"
    ]
  },
  {
    "review_description": "Press home button & click unistall the app fastly we can uninstall the app when the locking is active. I prefer u to switch app as device administrator. Also give fast bootup that app starts working suddenly when power on.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "I like this app the most but I need a little improvement in this for 5 star ratings. Please add an option to put specific apps on time lock and make sure that within block time user couldn't be able to use app at any cost.Make sure that I could be able to choose my apps to run in blocked time.Such a...\nFull Review",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Useful but add call facility during phone lock",
    "themes": [
      "Useful"
    ]
  },
  {
    "review_description": "Can easily restart phone and delete app before the lock function boots up again",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "This app is very useful to me",
    "themes": [
      "Useful"
    ]
  },
  {
    "review_description": "It is amazing, it's definitely what I need",
    "themes": [
      "Useful"
    ]
  },
  {
    "review_description": "Easily bypassed it No need to restart",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "This app is most important for students",
    "themes": [
      "Studying"
    ]
  },
  {
    "review_description": "This app if for phone addiction do not complain that you downloaded an app and rate it one star because the app did whats its supposed to. If you are worried about emergency use common sense. Dont lock your phone in the middle of a night out or at the store do it at your home were you have access ...\nFull Review",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "I am still able to access hardware buttons and then if I close all the recent apps this app also closes then wats point of using it. If u fix this then I will definitely give 5 stars Because I want it to be strict so that I can't touch my phone until the time gets over...!!! Please update the app",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "I have tried many apps but this is one of the best apps which just can't be tricked by uninstalling it provided you have activated it as device administrator",
    "themes": [
      "Restrictive"
    ]
  },
  {
    "review_description": "If u click the home button, there's a 2-3 sec lag before it blocks the screen once more. I uninstalled the app in that time.",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "Did what it advertised. Don't lock phone without planning forward",
    "themes": [
      "Restrictive"
    ]
  },
  {
    "review_description": "It can be Uninstalled after phone is powered on ....if done quickly.",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "Plz make a feature to call someone when blocked",
    "themes": [
      "Restrictive"
    ]
  },
  {
    "review_description": "I just suggest to add it to device adminstrators so we cant have time to uninstall it when we press the home key",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "It stopped working as soon as I cleared background apps",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Awesome.... Exact what i needed,,, you have to try it on your exams time..... 😁 A big thumbs up 👍👍",
    "themes": [
      "Studying"
    ]
  },
  {
    "review_description": "Awesome ....just lacking in emergency call.",
    "themes": [
      "Restrictive"
    ]
  },
  {
    "review_description": "Amazinggg app omfg this is the best app ever to prevent me from too much using phone",
    "themes": [
      "Unplug",
      "Time Management"
    ]
  },
  {
    "review_description": "App didnt really work for my phone (xiaomi redmi 4) it just does not collect any data on my apps usage. I sent an email to you guys but they have not responded yet",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "This app had awesome potential but has become useless due to not fixing bugs despite repeated reports froms users. Last update came 2 months ago. They always claim they're working towards fixing bugs but in reality probably do nothing. No more patience. _/\\_",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "This is an awesome app for those who are addicted to mobile phone apps such as games and social networking sites. I have successfully controlled my phone addiction and controlled use of many apps that were killing my time. Uninstalling an addictive app is not useful , as sooner or later we install i...\nFull Review",
    "themes": [
      "Addiction",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "The concept is nice however it is very difficult and tedious to set a specific time for every app it would be way more easier if we could set the time for multiple apps together. Also, if we could see how much time is left every time we open the app, it would be way more helpful",
    "themes": [
      "Good Idea",
      "Add Features"
    ]
  },
  {
    "review_description": "Actually it was the perfect app I wanted... But... It isn't working properly.... After using a long time in restricted apps it just shows only a few minutes in it....",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "When it alerts me to 70% usage, if I am typing something, I somehow am able to disable unintentionally... so using app think time will be up any second and it's no longermonitoring... then I check settings and that app isn't in the list anymore... useless!",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "The app is good but it is not able to stop me to open the apps I am addicted to ... I can just simply uninstall this app if I want to use the restricted app ...",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "Been looking for a decent app to restrict my phone usage and tried alot...this one Does the job perfectly!!",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "Useful for those who wants to succeed in life",
    "themes": [
      "Productivity"
    ]
  },
  {
    "review_description": "This is a perfect app to monitor your mobile usage. Worth installing app. It helps me to monitor my time that how much time I spend on each app. It has helped me a lot to control my usage addiction. Earlier I used to spend 7-8 hrs on my mobile but now due to this app I am able to restrict my mobile ...\nFull Review",
    "themes": [
      "Self Monitoring",
      "Statistics",
      "Addiction"
    ]
  },
  {
    "review_description": "This app is just what I want with the ability to choose which apps to control, set a timer, and restrict usage times, except it doesn't restrict the app at the times I've chosen, so I'll have to use another app with it to block certain times. This is the first app I've found that will shut off cert...\nFull Review",
    "themes": [
      "Timers & Blockers"
    ]
  },
  {
    "review_description": "This app is the best app for when you notice you're spending so much time on an app or a game and you need to cut down on the time spent on the app. It works perfectly fine.",
    "themes": [
      "Timers & Blockers",
      "Unplug"
    ]
  },
  {
    "review_description": "What's the problem with this. It doesn't track usage of selected apps. It barely records it and most of the time it doesn't record app usage. Any solution??",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "great little app, very simple and effective, does just what it says on tbe tin, works really well and easy to use",
    "themes": [
      "Easy to Use"
    ]
  },
  {
    "review_description": "It is a good application that helps you manage your time well and also help in appropriate distribution of time to be spent browsing on applications on your phone",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "A good start. Please consider using android's device admin feature. Its by no means a foolproof solution, but it adds an extra hurdle, and only requires adding a line to the apps manifest and requesting permission. (I think... IDK much about android app development.) There are other addiction an...\nFull Review",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "This is the best application in play store which has the potential to reduce our smartphone addiction. Also reduces Social media addiction. I RECOMMEND THIS APP TO THOSE WHO REALLY WANT TO CONTROL THE SMARTPHONE ADDICTION.",
    "themes": [
      "Addiction",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "This seems like it would be a good app, but it caused significant lagging and slowed down operations on my phone.",
    "themes": [
      "Performance"
    ]
  },
  {
    "review_description": "OK for self awareness but drains battery and very hard to do a parent control. Gotta improve how to use as a real parental control for kidos. Kids can not control themselves.",
    "themes": [
      "Awareness",
      "Performance",
      "Parental Control"
    ]
  },
  {
    "review_description": "Would be nice if the apps that you selected weren't always unselected the next day",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Really simple and effective app. This minimize my use of smart phone drastically and increase my productivity and ability to concentrate on work. I want to try blackout app but still its not available in my country india.",
    "themes": [
      "Easy to Use",
      "Time Management",
      "Productivity",
      "Working",
      "Focus"
    ]
  },
  {
    "review_description": "Good app but i can access my phone again after rebooting it. Also cannot take calls properly",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "simple and effective. But i want to set routine. Everyday i have to set",
    "themes": [
      "Easy to Use"
    ]
  },
  {
    "review_description": "Didn't keep my phone inaccessible. I was locked out when I set it and came back to it before the end time and it was gone.",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "Does not work at all when i set the time",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Does not work after trying to use it for a while, says rediculous numbers. Rn it says that 13 hours on the phone, which is approx since i turned my phone on. Hace not been on it for that long haha. Idk whats wrong w it",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I like the app and it's idea, but I'm discouraged by the poor design. I would love to see material design and better icons and UI.",
    "themes": [
      "Good Idea",
      "Design Flaws"
    ]
  },
  {
    "review_description": "I'm happy about the app but even when I on the notification bar I'm not getting on my screen and it would be nice if we set limit per day",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Sorry, but it incorrectly counts usage time, always adding 1-3 extra hours. Sometimes it corrects this later. Could you also implement an option not to count simple waking ups, without unlocking?",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Dear team, The app is really good to analyze but there is a lit of improvement required.. It is considering alarm time also in count.. I have set alram 6am and 630 after alrm it considered that 20 min as usage... I request u have to fix it.. Once lock is opened and locked that time can be consid...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "So far(one day), so good. Very helpful. Thank tou developers for making this app. I was asking my computer science friends if they could make such app for me, but I found it here, I'm very thankful.",
    "themes": [
      "Useful"
    ]
  },
  {
    "review_description": "One of the most helpful app I have ever seen! There are some bugs, fix them quickly. More statistical options could be added. There may exist a option to clear previous data",
    "themes": [
      "Useful",
      "Detailing"
    ]
  },
  {
    "review_description": "The app says I have spent 61 hours on my phone today. Is there anything I can do to fix this?",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I like it, but i will like it more if you add an option which stops counting when i use navigation app such as google map.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Does exactly what it says, had no problems using it, and, most importantly, has no ads! Definitely worth downloading if you're curious about how much you use your phone.",
    "themes": [
      "Statistics",
      "Self Monitoring",
      "Awareness"
    ]
  },
  {
    "review_description": "It is good but It needs improvent i have lost my usage time twice a day...it started recounting",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "The app is good and keeps a good track of our day to day usage pattern. . Loved it",
    "themes": [
      "Statistics"
    ]
  },
  {
    "review_description": "Its very great app. which app we are used in timeline",
    "themes": [
      "Statistics"
    ]
  },
  {
    "review_description": "Good app. Can help in optimizing mobile usage.",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "Awesome app. Loved the concept",
    "themes": [
      "Good Idea"
    ]
  },
  {
    "review_description": "Tells me I'm using the phone for hours while I'm sleeping. Would be nice if I could delete those on the timeline.",
    "themes": [
      "Sleeping",
      "Statistics"
    ]
  },
  {
    "review_description": "This app works properly sometimes . Sometimes it is not working and displaying any number of hours I hardly used my phone for half an hour and it showed 19 hrs .",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I think it will truly help me break my phone addiction, but I would suggest they add a feature where you can see how long you spend on a particular app. For example: I don't care about how much time I spend texting (because I don't do it that much) but I do care about how long I spend on Instagram o...\nFull Review",
    "themes": [
      "Addiction",
      "Add Features",
      "Detailing"
    ]
  },
  {
    "review_description": "Great little app. to help me manage my time on my phone",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "Its really great. Im medical student and i was addicted to mobile but this software changed my life and my scores in exams! Thnx for your great idea",
    "themes": [
      "Good Idea",
      "Addiction",
      "Studying"
    ]
  },
  {
    "review_description": "It show wrong info... it got stopped",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Very good app.It saves my time...I came to know how many time I was wasting",
    "themes": [
      "Feeling Better",
      "Awareness"
    ]
  },
  {
    "review_description": "The data shown in the app is off by about 6-7 h last 2 days. By all means. Useless. Will uninstall and search for an app with appropriate data display. If I'm giving you (your app, I know nothing is stored, jadajada...) the access to all that is requested, I expect something more at least in acc...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Is there a way for usage to be tracked from 12 am to 11:59 pm? Often times I'm awake in the night and use my phone and the usage isn't counting towards my daily limit. Also, it would be nice to be able to add a note to a day in case usage is high and you want to know why.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Great app for managing your phone use. An essential tool for everyone in this day and age, I think.",
    "themes": [
      "Self Monitoring",
      "Time Management"
    ]
  },
  {
    "review_description": "It's a good app however the daily usage behaviour pie chart is not working",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "Its an easy way to tap ur usage.",
    "themes": [
      "Self Monitoring"
    ]
  },
  {
    "review_description": "Potentially very good. Just need to be able to block certain apps from counting as time or breakdown how long per day in each app. Main problem is I use Google Maps whilst driving and this counts towards my phone usage! If it could calculate which app was used for however long youd see what is produ...\nFull Review",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "The unclock counter works accurately,but the usage time counter is inaccurate.To test this I used my phone continuously for 1 hr after 12am(when the counter resets itself for the next day),the app showed 1 hr 12 mins which is practically not possible.After this I locked then unlocked my phone the co...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I don't know, whether the developer tested this or not, this is not working at all. There is no data, analaysis or anything, It's a blank. It just shows how many hours this app was active, thats it. I don't understand how playstore let it upload.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "The unlock counter seems accurate, but the screen-on or usage time seems off.2 I had noticed a growing discrepancy in the last few days. To test, I had charged up my phone to 100% and did not use it until after midnight to reset the variables for the test. I used the phone's built-in settings to che...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Recorded my data really well then apparently deleted it overnight so I can't look back on past trends so... pretty useless.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Potential goodness, but keeps missing activities and doesn't log usage accurately. Eg it missed logging an entire 30+ min session",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Thank you so much for making this app. I realise now that how much I was wasting my time on mobile. This is must app to have. I will surely recommend this app to my friends.",
    "themes": [
      "Awareness"
    ]
  },
  {
    "review_description": "Just used my device for 1hr49 mins, as recorded by the app, locked it and unlocked it again. Today's usage reading now 7 mins... This just the latest example in a consistent underestimate of my usage. This app has one job and it can't do it",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It is good overall, but if I let it play Spotify while I am studying and the screen is turned off it still runs the counter. FIX THIS!. if (isActive && screenTurnedOn == false) { disableCounter(); } or switch the flag or whatever way it works, but it definitely should not keep running the coun...\nFull Review",
    "themes": [
      "Bugs",
      "Studying"
    ]
  },
  {
    "review_description": "It worked well at first but after a couple days, it started showing the incorrect amount of time that I spent on the phone",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "For some reason my time has been set to negative 1million something houndred thousand. It has been this way for the past week and doesnt reset at the start of a new day. My unlocks are also 0 or extremely lower than the actual amount of times i unlock it.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Didn't work for me at all. After about a minute of usage, it said my usage was 2 hours and 10 mins. However I likes the interface. Clean and intuitive.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Totally inaccurate. Ive been using phone for the whole day and it tells me 7 min",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Potentially a really great app. Unfortunately, the data collection was buggy and inaccurate.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Worst app Showing that I have used 46 hour in one day",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "first i thought this is one life saver app.but later i realized that the data is inaccurate.the idea of graphs and charts are excellent.but why cant u synchorize the app data with the actual mobile time.This sucks right there.please do something to make this app 100% accurate",
    "themes": [
      "Statistics",
      "Bugs"
    ]
  },
  {
    "review_description": "I want it start daily report at 12 am",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "It's my life Saver . Thank u .",
    "themes": [
      "Feeling Better"
    ]
  },
  {
    "review_description": "Really awesome it saves my life..!!!",
    "themes": [
      "Feeling Better"
    ]
  },
  {
    "review_description": "This app is awesome. Other apps have a gateaway thing. This one doesnt.. And it lets you use calls n messages when ur in the take a break mode.. 5 stars. Awesome.",
    "themes": [
      "Useful",
      "Restrictive"
    ]
  },
  {
    "review_description": "Just when I thought this is the best app out there to lock your phone, mind somehow found a loophole. One was with rebooting, and I fixed it by going to the settings. But now there's another loophole. When I press my recent apps button, and then press clear, even this app stops working. My god , ...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "i love this app,, but I am facing one problem, after every 4 to 5 days i get an error saying date or time is not correct (i am using automatic date and time settings). I hv to force stop the app and restart it. Please resolve this issue.",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "It is automatically closed while I am going in phone lock settings.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Froze my home screen on Galaxy S7. Can't move icons or find my app folders now.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "A must have app for self control",
    "themes": [
      "Self Monitoring"
    ]
  },
  {
    "review_description": "So far so good. But I think it has some issues when used with Microsoft launcher. When my phone is already locked it doesn't show the waiting screen of UBhind. It automatically closes and goes back to my homescreen when I try to click it. It still does its job though. Overall, I like this app an...\nFull Review",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "just after 2 days of use it gives an error, stating date or time not correct...and the error flashes again and again...can not even use the phone properly.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Thank you for this amazing app, im just need you to add an option to prevents the app from force close, also the data usage not counting in my device although i gave the app all the asked permission and services!",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "Absolutely Fabulous Fantastic Futuristic !!! Please add mobile data and WiFi restrictions because phone without internet is too much LESS distracting. I know it's difficult to implement. But what if I give u root permission? I think then it's possible, right?",
    "themes": [
      "Add Features",
      "Unrestrictive"
    ]
  },
  {
    "review_description": "This app doesn't work well if we have two user accounts in Android. I calculates other users detail as my logs. Please debug it.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "The apps are not getting closed automatically even after I have exceeded the limit I am simply able to increase the time even it has exceeded the time limit Please fix this Bug! Will increase my rating after that...",
    "themes": [
      "Timers & Blockers",
      "Bugs"
    ]
  },
  {
    "review_description": "It is not working on one plus 3, switches off automatically and hence the usage is not counted correctly",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It's the best useful app for dealing with phone addiction and procrastination I suggest saving data of settings with email so one of us can sync with other devices . + i can surpass the lock just by rebooting !",
    "themes": [
      "Addiction",
      "Bypassable"
    ]
  },
  {
    "review_description": "The application cannot work when i put mobile in safe mode please resolve the problem",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I would like to request a feature of Restricting any data usage (both Wifi & Mobile). Phone is way less distracting without internet",
    "themes": [
      "Unrestrictive",
      "Add Features"
    ]
  },
  {
    "review_description": "its an amazong app ...everyone who wants to focus on their work shuld install ths application ....it really works ....hats off to u guyz ..amazing worm",
    "themes": [
      "Focus",
      "Working"
    ]
  },
  {
    "review_description": "Need it to overcome my smartphone addiction",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "One of the best app for no addiction, but make it more strict",
    "themes": [
      "Addiction",
      "Unrestrictive"
    ]
  },
  {
    "review_description": "Can you please make it so you are only allowed a limited number (like 3) urgent unlocks per day? If I have a lot of points, I keep over-using the \"urgent unlock\" feature.",
    "themes": [
      "Unrestrictive"
    ]
  },
  {
    "review_description": "Love being able to limit my usage and times of day that I can access different apps.",
    "themes": [
      "Timers & Blockers",
      "Time Management"
    ]
  },
  {
    "review_description": "The UI was confusing (in older versions) but otherwise its a very useful app.",
    "themes": [
      "Useful",
      "Design Flaws"
    ]
  },
  {
    "review_description": "Its very helpfull, seriously, it could reduce my addict on phone",
    "themes": [
      "Useful",
      "Addiction"
    ]
  },
  {
    "review_description": "I really thank you for creating this kind of appT_T The only way for me to overcome smartphone addiction luv ubhind the greatest app ever at leaat for me",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "Very very nice app. Does one simple job and it excels at doing that. But with Mi phones, the 'keep locking after reboot restart' doesn't work. I hope they'd fix this.",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "It works well. Even if you remove the battery it won't let you use the phone. Does anyone know something somilar that i could use on my Pc. Windows 10.",
    "themes": [
      "Other Devices",
      "Restrictive"
    ]
  },
  {
    "review_description": "A easy way to get off from distraction during studies. A MUST APP for students who are addicted to social world.",
    "themes": [
      "Studying",
      "Focus",
      "Addiction"
    ]
  },
  {
    "review_description": "This app should have had contact access in case of emergencies",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "This apps does not work at all on my phone...oppo f5..i'm typing this review when my phone should be off..",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Accidentally turn off my phone then I couldn't input the time that I want it to work",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It helps me force myself to clean my room so i have 0 distractions",
    "themes": [
      "Focus"
    ]
  },
  {
    "review_description": "i would love to recommend this app to all my friends as its very helpful and can save our future...but remove these ads first😍😉",
    "themes": [
      "Useful"
    ]
  },
  {
    "review_description": "Brilliant, it keeps me of my phone at school night hours so I can get a good night's sleep",
    "themes": [
      "Studying",
      "Sleeping",
      "Unplug"
    ]
  },
  {
    "review_description": "Good App.. Only if i can Access my contacts.. It would be great.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Good except the only loophole is that if I restart my phone I can easily access everything",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "Perfect app for locking yourself out of your device and manage your personal work without any interruptions",
    "themes": [
      "Unplug",
      "Working"
    ]
  },
  {
    "review_description": "Scheduled lock simply doesn't work.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "best app available on playstore for managing distractions",
    "themes": [
      "Self Monitoring"
    ]
  },
  {
    "review_description": "Best app for mobile addicted people",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "It would be great if I could set multiples schedules",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Awesome app to lock my phone when i need to be focus",
    "themes": [
      "Productivity"
    ]
  },
  {
    "review_description": "Best app keeps me out of my phone",
    "themes": [
      "Unplug"
    ]
  },
  {
    "review_description": "The best app for the sake of students",
    "themes": [
      "Studying"
    ]
  },
  {
    "review_description": "Works well and simple to use. Blocks access to your phone/home screen/apps for a customisable amount of time. Confirms that you want to do this as once you click yes you cant access other apps. Allows interaction with any controls in the notification area for example spotify/music apps. Full scr...\nFull Review",
    "themes": [
      "Easy to Use",
      "Timers & Blockers"
    ]
  },
  {
    "review_description": "I think this app designer must work on mi phone. As after rebooting mi device we can easily unlock the even if we have turned on the device locked after reboot feature is on...🤔the developer must work on this problem as mi phones are currently mostly used by every Indian students...",
    "themes": [
      "Studying",
      "Bypassable"
    ]
  },
  {
    "review_description": "While the lock works exactly how I want, the schedule function does not work. It doesn't lock my phone at the scheduled time. I'm writing this at a time that I should not be able to access my phone. Also, I'm disappointed that the app only allows one scheduled lock period a day.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Liked the idea of scheduled times but all I had to do was hit my lock button or swipe my phone and I got right in like the app wasnt even there. But I knew it was cause it fritzed out and crashed right after each time",
    "themes": [
      "Good Idea"
    ]
  },
  {
    "review_description": "I think this is what I wanted But I need some more update like see here in my phone whenever I try to on my phone it just shuts down in just one second but I need that it should be just locked for some time Otherwise it is best app",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "I have had uninstalled the app and installed it again, it's not working. Plus the periodic lock does not work.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Doesn't work on Pixel 2 although worked fine on my Nexus 5X. Could be the lack of support for Android 8.1?",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I HAVE LOCKED SOME APPS FOR 1 hour and locked phone and put in table but almost i can use them after 5 minutes bad app",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Keep me out does not keep me out. I've reinstalled the app on multiple occasions and anytime I unlock my device, I am still allowed access to my phone. Please look at the reviews of your customers and fix the bugs",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Things should be improved that we can do lock that particular app that we dont want to open for a specific period of time then this will be best app....",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Please add it block apps feature They i can focus in my study please value for my feedback I can block like whatapp fb instagram etc...",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Great App But It Would Be Nice if u could add A Widget That Can Be customised , and With Just A Click Of a button We can Lock our phone. Hope To See this feature in the upcomming update",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Have been facing a bug from the past weak. The app does not keep the phine locked after restarting, even when the particular option is selected and all permissions are given. Help required!",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Does not work on Moto Z2 force. Please make it work and I will change the stars",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "App keeps telling me I have used my phone for over 3 hrs even when my hands were not on the phone or phone was charging. Your app sucks.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Need more features....like breakfree apps...",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Does not track time correctly which is the sole purpose of the app.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I really want to love this , except it keeps automatically unchecking all the apps to be tracked which defeats the purpose of the app. I hope it is fixed soon so I can continue to use.",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "Really annoying app. Keeps on unchecking all the app needed for tracking.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I does not track .. all apps are included for tracking but it does not track... Every day I have a record of using for 10-12 s ..",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "A very good application that enables you to slow down addiction... Well done 😁",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "Excellent app, very useful tracking of apps habits​.👍👌",
    "themes": [
      "Statistics",
      "Self Monitoring",
      "Break Habits"
    ]
  },
  {
    "review_description": "Was ok, i selected some apps to exclude from tracking but after a while I noticed it stopped tracking all of them altogether. Really annoying.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It tracks notification even when I do not open it, hence the time tracked is longer than the real usage time. Need to improve",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "App worked great the first day but stopped working after that and wouldn't track any of my usage",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Nice Idea, but Shake Counter is Way Too Sensitive",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "App is almost there but clicking on the phone icon then lets you scape back into other apps but clicking on the android home button from the phone app. While I'd like to be able to answer calls while locked, I'd be happy to get rid of the phone button and sacrifice receiving calls to keep the lock f...\nFull Review",
    "themes": [
      "Bypassable",
      "Add Features"
    ]
  },
  {
    "review_description": "Dear Admin, This app has a problem , whenever I am clearing my device's ram this app got disabled and unlocked. So please fix this issue so that we could get rid of our device. And please raise the no. of shakes at least upto 500. Concept is really good. You people have done really very good job. ...\nFull Review",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "When I shake my mobile phone it counts 7 or 9 shakes on one shake plzz fix it.. I really love this application.. This error comes on samsung s6 edge plzz fix this",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I like all other apps, it doesn't lock the only app u want to lock for certain time interval.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It's a good idea, unfortunately it fails to lock my screen, lock the multiscreen option, lock the status bar and it takes half a second of shaking hands turn of, even at it's maximum setting",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "It doesn't work! After I lock my phone and again unlocks it stops working! Bad app... Fake",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "The entire phone gets locked..i just wanted to block specific apps for specific time..so no use to me...",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Doesn't work well for androids. I can still access chat heads easily. Shake counter too sensitive.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I love this app.. bcoz it allow me to analyse me time.. 👌👍👍👍",
    "themes": [
      "Statistics",
      "Time Management"
    ]
  },
  {
    "review_description": "Great app.Saved my lot of time.",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "C,mon make with no shake!! I still can open it i just wanna study an focused to my book but i still can open with shake",
    "themes": [
      "Bypassable",
      "Studying"
    ]
  },
  {
    "review_description": "Almost there but when I tap on phone button. It unlocks a the I am free to Rome for 30 sec",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "It cant even time lock specific apps? What is it meant for?",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "For time being mobile will be away from child",
    "themes": [
      "Parental Control"
    ]
  },
  {
    "review_description": "It was wonderful if u could apply it for apps that u choose. Not the whole device",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Not working still I gave 4 stars",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It sucks, works only few minutes then says\"error occurred......\"",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Really useful while studying!!",
    "themes": [
      "Studying"
    ]
  },
  {
    "review_description": "Love the idea",
    "themes": [
      "Good Idea"
    ]
  },
  {
    "review_description": "Perfect for studying",
    "themes": [
      "Studying"
    ]
  },
  {
    "review_description": "Hey, what's the use of timer? Really? What's the use of using this if we can stop this by shaking?",
    "themes": [
      "Timers & Blockers",
      "Bypassable"
    ]
  },
  {
    "review_description": "Plz make a option so that if someone wants to remove that shake feature then they can.",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "U can unlock it by pressing the phone button lol",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "Functionality to get notified /blocked if I overshoot usage of an app by a set of threshold time is missing. Without this functionality app is not very useful.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Great app, but please do the following in future versions :1. Lock for 15,30 ,45 mins etc as you have but also place \"for custom \" where someone can lock phone now for the duration of his preference eg 25 minutes 2. Create a link between the location of the phone and unlock. So for example I may...\nFull Review",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Just one thing is needed, i.e. it should let us choose apps which can be used even when the device is locked.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "It was working nicely in the old version and close the phone in the whole submitted period, but now I can breach the closure time and use the phone - I'm writing this review now while it's supposed to be locked up - please manage this main issue",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "This is the best app ever, it is exactly what I needed it will help me with my addiction. Thanks a lot",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "While locking the phone by using this app..can I get incoming calls..",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "At least unlock the option to call please think about it i love this app😍",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "It was working great but now it doesn't lock my phone",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "pro version not able able.",
    "themes": [
      "Price"
    ]
  },
  {
    "review_description": "Good app, but UI could be even made simpler",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "Love this app! Helps me a lot to get rid of my procrastination tendencies. Just 2 quick suggestions for future features that would make the app perfect for me: 1. I'd love to have a possibility to start a pomodoro-like sequence of lockouts and unlocks without having to start a new lockout after ...\nFull Review",
    "themes": [
      "Addiction",
      "Break Habits",
      "Add Features"
    ]
  },
  {
    "review_description": "Change the time and then you can play your mobile phone, restart your phone then direct to clock option and change the time 😉",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "I love this app....best app ever For concentration 😇",
    "themes": [
      "Focus"
    ]
  },
  {
    "review_description": "Why would you make me pay for app-specific lockout? I want to disable YouTube and Dancing Line so that I can't procrastinate, not messaging!",
    "themes": [
      "Add Features",
      "Break Habits"
    ]
  },
  {
    "review_description": "It is really helpful 🙏thanks a lot for such apps Everyone should give it a try #9pp",
    "themes": [
      "Useful"
    ]
  },
  {
    "review_description": "I wanna scroll Facebook/Instagram for 5 or 10 minutes, and then this App lock FB or IG for 30 minute or more. Can you do that..? Will buy the pro version if so.. thx a bunch! 😉",
    "themes": [
      "Timers & Blockers",
      "Add Features"
    ]
  },
  {
    "review_description": "I hope you guys add a feature which locks the phone for days i like to lock my phone for a month plsssss do this feature 😊🙏",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Easily disabled by holding down the power button until the phone is off, then holding the volume down button when turning the phone back on (bringing you into safe mode)",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "This app is really helpful for a student who wish to. Have some studies",
    "themes": [
      "Studying"
    ]
  },
  {
    "review_description": "I love this app removing my phones addition",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "I don't know why people are rating this app bad. This app is really helpful and the best i have used so far.",
    "themes": [
      "Useful"
    ]
  },
  {
    "review_description": "Allow use of selected apps not working , phone gets locked even after opening allowed apps. Consider this in upcoming updates other than that it's good as advertised. Thanks",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "\"Allow use of specific apps\" doesn't work, so the app is useless and a waste of money for me until this feature is fixed.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Very helpful, only reason this is 4 stars and not 5 is it has a glitch where I can't use my whitelisted apps until I restart my phone.",
    "themes": [
      "Useful"
    ]
  },
  {
    "review_description": "Cannot auto run after turning on and off Ultra Battery Mode",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Why Premium.... Ass Hole",
    "themes": [
      "Price"
    ]
  },
  {
    "review_description": "Nice aap.... It helps me to control the usage",
    "themes": [
      "Self Monitoring"
    ]
  },
  {
    "review_description": "great app but could be better, after i set the amount of time before it locks (let's say 1 hour) after it unlocks, it dosent lock again after the next 1 hour of my screen on.. So fix that and i would rate higher.. 👍",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "I bought the premium version. I like the idea of the app and it is what I wanted. What I really need though is a total lock out of some apps while I can use the calculator or the calendar etc. When I choose to allow some apps is still locking me out of my phone completely.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Whats wrong with this APP can't receive calls in complete lock out... Nonsense it is.. And reboot Ur phone and Lock me out doesn't work.. wasted my money in this",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "We can easily come out of the app by tapping ultra battery power saving mode. No use of this app.My money wasted",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "I wish if the app had more than one scheduled period a day!",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Does not lock the phone after cleaning the recent apps",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "Good time saver",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "The \"Allow use of specific apps\" mode could be cracked by uninstall this app from the home screen. PLEASE IMPROVE AS FAST AS POSSIBLE!!!",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "When I turn on the Lock Regularly option the notification goes Haywire keeps refreshing. Love this application but this is something that affects the regular use of the application. Please fix it.",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "Not doing what it is supposed to do even after paying for it. Specific app lockout not functional at all. The other lock works for few minutes only",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Whenever i am trying to lock, app exits, notification says lock is active, but nothing happens to my phone, only The app itself get locked out, it worked well as free version, but now that i have subscribed for month, it doesn't work...",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I use this app to help me stop using my phone before bed - it's great because I can quickly check my emails (but not read them) before turning in, and it keeps me away from the dreaded time-suck that is YouTube. I lock my phone in my locker and only check it on breaks at work, so evenings are defini...\nFull Review",
    "themes": [
      "Working",
      "Unplug"
    ]
  },
  {
    "review_description": "I was considering to pay for the full version until I found out that the app's still has some glitch like sometimes you can still access the blocked apps even when the blocker is running. any suggestion of what can I do to prevent this? I have some apps that also required to access the \"running in t...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "4 🌟 for a perfect app lock and make me distraction free! +1 🌟 for fast customer support! In past I used 3-4 focusing app but somehow they work wrong when I am clearing cache memory! They don't provide making profile option more than two! Rubbish! Costly pro version too! This is perfectly worki...\nFull Review",
    "themes": [
      "Timers & Blockers"
    ]
  },
  {
    "review_description": "Just what I needed! I typically have a ton of articles to read for class so I read them from my phone....but every time the article loses my attention I hop over to social media. This app has put a stopped to that! I get homework done a little quicker now.",
    "themes": [
      "Focus",
      "Free Time"
    ]
  },
  {
    "review_description": "Great app. Time periods to block certain apps are customizable, and you can also set how strict the app is. Helped me a lot to stop mucking around on Facebook when I'm working. I also really like the customizable phrases for the block screen. Keep up the great work! 😁",
    "themes": [
      "Timers & Blockers",
      "Working"
    ]
  },
  {
    "review_description": "Love the app! Just that I've been facing a glitch or two lately in actually enabling the profile, I have to keep swiping the lock repeatedly until it falls in place. I hope it can be resolved in a future update, otherwise it's 5 stars from me😁",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "Love this app! It helps to keep me on track when I need to get work done. And the developer is very responsive to feedback. When I sent a note letting them know about the distracting sound from the video ads that came on after setting the instant block, I got an email minutes later saying they t...\nFull Review",
    "themes": [
      "Working",
      "Focus"
    ]
  },
  {
    "review_description": "There's a feature that allows you to customise a message so you can tell yourself what you would like to be told when you're trying to procrastinate. The app helps a lot when I want to study, it's not hard work to set the app up and allow the app to prevent you from using the apps you're most obses...\nFull Review",
    "themes": [
      "Self Monitoring",
      "Studying",
      "Impulse Control"
    ]
  },
  {
    "review_description": "This app is helping me so much to be present with those around me and my family. My daughter set the password so I have no clue which makes it even better! I can't sabotage myself.",
    "themes": [
      "Feeling Better"
    ]
  },
  {
    "review_description": "A great tool to help you stay on track. I never realized how much I've procrastinated until i activated the app. The inspirational quote that you can add certainly helps 💯",
    "themes": [
      "Focus",
      "Awareness",
      "Rewards & Motivation"
    ]
  },
  {
    "review_description": "Only shortfall of the app is that, the lock can be bypassed by opening the blocked app in split screen(atleast works for whatsapp). Other than that its neat and does its job well.",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "This is really a good app for people like me who get deviated my seeing the phone when it's beside me .I don't know why on Earth will my finger always tap on the YouTube app .So for people like me can/ should immediately install this application as soon as possible for their benefit. This is still ...\nFull Review",
    "themes": [
      "Addiction",
      "Impulse Control"
    ]
  },
  {
    "review_description": "Worked well for a while then stopped with out warning on error messages the service just doesn't start at the scheduled time. Plenty of other apps that do the same thing though.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "With the unique features of this app, this is the one to go fir me. However, I have some constructive feedback that hopefully if considered will make this app really special : 1 ) Limiting the number of times I have access to the app. I loved this feature, but it is very easy for me to get distract...\nFull Review",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "The one problem I have with this amazing app is that if you change the date and time you can avoid pretty much everything which is why I think you should be able to lock that Auto date and time option. Thank you.",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "Great app, really useful when studying. It let's you block as many apps as you want for a decent length if time and on the free version putting in passwords every 2 minutes just puts you off the app",
    "themes": [
      "Studying",
      "Timers & Blockers"
    ]
  },
  {
    "review_description": "This app is awsome it saved me from wasting time and going on other apps when I need to be working or studying. This app is also simple and not complicated or hard to use like other app blockers I have tried. I wish I would have thought of this before because I definately have trouble focusing.",
    "themes": [
      "Time Management",
      "Working",
      "Studying",
      "Easy to Use",
      "Focus"
    ]
  },
  {
    "review_description": "Good concept, but the developers failed to make it effective for many devices (such as mine), in which it doesn't even work! No app blocking: really disappointed.",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "Great productivity app! However, Needs improvements in: 1. Running in background/force stop - sometimes the app deactivates w/o permission. 2. Accuracy of date & time - I'm feeling uncertain on the accuracy of the scheduled block in terms of accurately keeping track of days and times the app wil...\nFull Review",
    "themes": [
      "Productivity",
      "Add Features"
    ]
  },
  {
    "review_description": "No difficult to open this lock app. Simply remove the app page and app will be open . Its useless.. no use without pro version..",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "Great app blocker to help reduce screen time. Would like to be able to set a daily limit on usage for certain apps rather than block them for periods of time.",
    "themes": [
      "Timers & Blockers",
      "Time Management",
      "Unplug",
      "Add Features"
    ]
  },
  {
    "review_description": "I liked this app before it became pay-only. It has its bugs (if my phone orientation switches from portrait to landscape while I'm typing my password for the app--usually because I accidentally moved my hand--it erases the password I've entered. Even when I've typed the whole thing and am reaching f...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Just got me off Instagram when I needed to study for my final. I hate it, but It's been helping me a ton. Almost like a parent!😂",
    "themes": [
      "Studying",
      "Unplug"
    ]
  },
  {
    "review_description": "I hope you could add specific URL blocking this will make a no turn around accessing websites of the apps.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "I love this app. Makes breaking my addiction to the cell phone much easier. Although I still need strong will of my own :)",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "great app! I have one suggestion though. maybe consider being able to block access to certain websites (Facebook, etc) for a duration of time.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "By far the best app I've found that helps you focus. I'd suggest giving the uninstall prevention tool for free, but I suppose it's easy enough for most people to have that level of self control. Though one huge feature that I was expecting was screen time control with a timer and not at a particu...\nFull Review",
    "themes": [
      "Focus",
      "Add Features"
    ]
  },
  {
    "review_description": "This app's full version helps me focus on what I need to do and help me follow my schedule. Friendly user interface. It's a great app overall! 👍👍 It would be great to add features like add 20 and 30 mins to the amount of time you can access an app when you try to unlock it. ❤",
    "themes": [
      "Focus",
      "Add Features"
    ]
  },
  {
    "review_description": "Nice app. But one can go back and disable it. This disabling should be removed.☺️",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "This app helps me from texting while I should be working. I like that I can pick which apps to block and also specify different times/days to activate it. Thanks!",
    "themes": [
      "Working",
      "Timers & Blockers"
    ]
  },
  {
    "review_description": "I am a pro user of the app and I recommend usage of the app to others.. I request only two modifications to help me focus team so that help me focus will be the best 1.Add block a profile for certain number of days 2.Allow usage with a password only upto certain amount of time and not beyond that...\nFull Review",
    "themes": [
      "Focus",
      "Add Features"
    ]
  },
  {
    "review_description": "This app has been instrumental in my study and personal success in completing a number of difficult tasks. I purchased this app due to its tremendously useful features",
    "themes": [
      "Studying",
      "Useful"
    ]
  },
  {
    "review_description": "I like the function that u could use passwords to access the apps you've blocked but u could only use for 2 minutes. Thank u for developing a such amazing app!",
    "themes": [
      "Timers & Blockers",
      "Timers & Blockers"
    ]
  },
  {
    "review_description": "A great way to start focused! I highly recommend this to anyone who finds our hard to stay off their phones while they're working. The inspirational quotation is a nice touch and the app is very easy to use.",
    "themes": [
      "Focus",
      "Working",
      "Rewards & Motivation"
    ]
  },
  {
    "review_description": "The application doesn't work properly. Even after I've paied . It's necessary every time enter the application to \"wake it up\", otherwise it doesn't work.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "In the pro version too you can fairly easily uninstall the app it just pops uninstall blocked messagebone time but if you switch to uninstall page second time yo can uninstall it in a click, I want refund",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "This is realy an awesome app, love it. works great, blocks all notifications and app.",
    "themes": [
      "Timers & Blockers"
    ]
  },
  {
    "review_description": "Too expensive,I don't want to pay for go pro features,I'd rather it be full of adds,than pay money,please change.",
    "themes": [
      "Price"
    ]
  },
  {
    "review_description": "Actually I love this app, it does work for my Samsung Galaxy Tab S2. But, not for my Xiaomi Redmi 5A. The app is active but I still can open my restricted apps 😕",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Helps me focus on my schedule by locking distractions on my phone",
    "themes": [
      "Focus"
    ]
  },
  {
    "review_description": "This app is not responding in Redmi 5A. It blocks the apps for 10 minutes and then stops responding.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It doesn't work, although i gave tge permission to launch iin backgtound, but yet it still doesn't work",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It's in the name. It helped me focus and kept me from overdosing on social media and gaming!",
    "themes": [
      "Bugs",
      "Unplug",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "Made me realize how much I look at my phone when I don't need to and even when I don't really want to! Thanks help me focus!",
    "themes": [
      "Awareness",
      "Focus"
    ]
  },
  {
    "review_description": "I just love it ... sometyms i get angry on it coz it is strict lyk my mom 😂😂 ... n yeah thnxxx HELP ME FOCUS to help me 🤗🤗🤗",
    "themes": [
      "Focus"
    ]
  },
  {
    "review_description": "Its vry nyc n gud app...ths is really helping me in concertrating on my work....I lyk it....",
    "themes": [
      "Focus",
      "Working"
    ]
  },
  {
    "review_description": "I bought pro version just to use superstrict option but i can very easily uninstall it even in strict mode..then what is the benefit of paying for pro version",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "This is the best app to focus.... Helps me a lot from distraction while fixing a task.... Thanks a lot for creating this app...",
    "themes": [
      "Focus"
    ]
  },
  {
    "review_description": "Wish I didn't have to pay money just to lock my apps for more than 30 mins. Other than that, it's fine.",
    "themes": [
      "Price"
    ]
  },
  {
    "review_description": "Simple block and linear graphs - but falls down with poor readability. Tiny font yellow on dark blue is fine, but against pale blue is virtually invisible. If there was a larger font or zoom then this would not be a problem.",
    "themes": [
      "Timers & Blockers",
      "Statistics",
      "Design Flaws"
    ]
  },
  {
    "review_description": "Nice simple app for tracking mobile usage. I would give five stars if the app also gave the average and median active duration, right now you just have to estimate it from the graph.",
    "themes": [
      "Statistics",
      "Self Monitoring",
      "Detailing"
    ]
  },
  {
    "review_description": "Doesn't work! One day it said I was live for 15 minutes and the next over 8 hours when my phone usage was very similar. Terrible",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Amazing. Start up time is a little slow but other then that it has really helped me. Would be cool to have more stats for amount of time as well",
    "themes": [
      "Detailing",
      "Useful"
    ]
  },
  {
    "review_description": "A very simple yet useful application. It helps me to track my time using smartphone and this app actually helped me to reconsider my time and spend it on other productivity task. Also there is no permission required for this app unlike other craps in the play store that requires tons of permission. ...\nFull Review",
    "themes": [
      "Useful",
      "Self Monitoring",
      "Awareness",
      "Productivity"
    ]
  },
  {
    "review_description": "Simple app with very light size on hard desk. Also, ads free. Keep it up . deserve 5 stars.",
    "themes": [
      "Easy to Use"
    ]
  },
  {
    "review_description": "I love it it shows me how much I actually use my phone and I show cut back on my phone i use talking to my cousin as an excuse to use it more",
    "themes": [
      "Statistics",
      "Awareness"
    ]
  },
  {
    "review_description": "Needs to be in open window to work, so no use for me, Samsung s6",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Great app cause compared to similar apps it doesn't need any permissions and consumes less battery. It would be great if the app would display a chart of screen-on-time per day and not just a chart with the number of device unlocks. Edit: it's showing both in the chart after the last update. perfect...\nFull Review",
    "themes": [
      "Detailing",
      "Statistics"
    ]
  },
  {
    "review_description": "This app has really taught me a lot about my usage of my phone and I'm quite shocked by how many times I actually turn it on during the day. I love it and after a month of using it, I definitely felt I could give a fair review.",
    "themes": [
      "Self Monitoring",
      "Awareness"
    ]
  },
  {
    "review_description": "It don't work. Useless app",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Had to uninstall it because it didn't fulfill my need. I want some more system features, like Calendar, Calculator,...",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Just what I was looking for to help with my phone usage! Would be nice if could set a timer to lock the applications and launcher to stop me changing them as my self control is poor!!",
    "themes": [
      "Self Monitoring",
      "Add Features"
    ]
  },
  {
    "review_description": "Great app to get rid of smartphone",
    "themes": [
      "Impulse Control"
    ]
  },
  {
    "review_description": "Best app across.Creative and preferred way to get rid of phone addiction.loved it.",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "This is an AMAZING launcher and I'll explain why I think you should try it. I was actually about to make something very similar when I discovered this and so far the use has been nothing short of amazing. Get ready to discard all the time waster apps and get a much needed detox! It does a great j...\nFull Review",
    "themes": [
      "Time Management",
      "Addiction"
    ]
  },
  {
    "review_description": "Thank you very much for this app. As a student, I find the app very useful. Nowadays, internet is now a distraction to our social life. You sir, solved a part in our society. Kudos to you, dev.",
    "themes": [
      "Studying",
      "Useful"
    ]
  },
  {
    "review_description": "Nice and improving frequently. Developer can you add the ability to go to alarms on pressing on time in the left corner. It will make it complete for me.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Very minimalist and allows one to have a smartphone and yet not be engulfed by it by providing a very pleasing experience to the eye and the mind. Keep up the great work buddy!",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "Neat. But would be really nice if we could get rid of notification bar. Please do it.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Add timing limit..Like on it for a period of time.. so that ppl can concentrate in their work.",
    "themes": [
      "Working"
    ]
  },
  {
    "review_description": "There is high scope for improvement..1) Could add support for more custom apps such as browser etc. 2) Try to display notification panel custom style with date, time symbols..",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "A brilliant idea but needs a lot of work.",
    "themes": [
      "Good Idea"
    ]
  },
  {
    "review_description": "Good. But give us option to customize apps displayed on main screen",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Interesting concept! I would like to revisit this app in the future. Currently it's in a usable state as is, but I would suggest adding more customization because people have different weaknesses and needs. Texting would be huge imo, tasks could direct to a note taking app of the users choice, e...\nFull Review",
    "themes": [
      "Good Idea",
      "Add Features"
    ]
  },
  {
    "review_description": "Hey Dev, I have an issue on Redmi Note 5 Pro MiUI 9.2.4 with the call function. The contacts are not sorted alphabetically. It's all randomly jumbled list. Another request that while entering the number, the whole qwerty keyboard pops up. Can you limit this to the number pad? And a separate sear...\nFull Review",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Hats off, dude. With the customizable apps coming in the next version, its going to be perfect for me and many other sane people. If you can tell when will the next update come?",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "I rearly write review about app but this app is easy to use and helps me to make down my phone addiction",
    "themes": [
      "Easy to Use",
      "Addiction"
    ]
  },
  {
    "review_description": "App is good but m not able to send or receive sms. Redmi note 4 ... 4gb 64 gb varient",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Must have coustom lables to reach apps",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Only if it had it's own lock screen. Because the default lockscreen is as distracting as the default launcher.",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "Works great so far. A simple app laucher would be nice for those times you do need access to apps. Perhaps it could be almost like a terminal? Scheduling when I could access my apps would be fantastic too.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "This app sucks... hang my phone... guys don't waste your time to download this app😡",
    "themes": [
      "Performance"
    ]
  },
  {
    "review_description": "Good app but a feature to be added dial pad should be added",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Great concept keep it up",
    "themes": [
      "Good Idea"
    ]
  },
  {
    "review_description": "Have to pay to use the dark mode? That should be something that's there by default. Also would like to have a shortcut to messages",
    "themes": [
      "Price"
    ]
  },
  {
    "review_description": "Awesome app, just what I was looking for. Please add some more details on how to use it.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Idea is great ..but should be able to personalise it more..example pick what days of the week you want to block apps not just time frame..and should be able to change times on preset icons as this would be more useful",
    "themes": [
      "Good Idea",
      "Timers & Blockers",
      "Add Features"
    ]
  },
  {
    "review_description": "Needs ability to add apps. It defaults to only 5 \"social apps\". I can't add games to be blocked or opera web browser.",
    "themes": [
      "Timers & Blockers",
      "Add Features"
    ]
  },
  {
    "review_description": "This app does not open even on very first installation",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I was not able to open the app at all most of the times. As soon as i install it opens but after that i cant open. Even the features arent that great.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "If the option was there to change names and specify start and finish times in all schedules it would be 5 stars from me...Also maybe the option for a few more schedules too! Great app!",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "phone smart helps me to manage mydaily routine تھنکس phonesmart",
    "themes": [
      "Break Habits"
    ]
  },
  {
    "review_description": "Helping me in life for self control.thanks phonesmart",
    "themes": [
      "Self Monitoring"
    ]
  },
  {
    "review_description": "It is very good application . Smartphone can easily occupy our lives and prove to be major destruction but now there is a new way to manage screen time smartly and keep the destruction away when we don't need them",
    "themes": [
      "Time Management",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "Phonesmart help me to manage my daily time according to my schedule and great idea",
    "themes": [
      "Time Management",
      "Good Idea"
    ]
  },
  {
    "review_description": "Best app for managing my daily routine and time..it helps me alot in setting my time according to my schedule loved it 5 stars from me",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "This phonesmart app helping me spend quality time.thabks developer",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "It has a bug. Wouldn't let you use phone after time was up for good won't ever be able to use phone. If this happens take the battery and the sim card out and it will give you just enough time to uninstall. Good concept though.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Phonesmart make me punctual and managing my time according to my schedule",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "Phonesmart great app I manage my time on this app and it becomes me a good husband I have a time to spend with family using this app",
    "themes": [
      "Time Management",
      "Feeling Better",
      "Free Time"
    ]
  },
  {
    "review_description": "This is awesome phonsmart app.helps me to schedule my life",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "Nice one, really appreciable idea!",
    "themes": [
      "Good Idea"
    ]
  },
  {
    "review_description": "phonesmart manage my daily routine schedule",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "It's a very useful app.",
    "themes": [
      "Useful"
    ]
  },
  {
    "review_description": "Great app.help me to spend quality time. Love this phonesmart app.",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "Love this qaulity time app.helps me schedule my life.thanks phonesmart",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "Phonesmart useful and best app to manage daily routine",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "very helpful for anti distraction thanks phonesmart developer",
    "themes": [
      "Focus"
    ]
  },
  {
    "review_description": "Phonesmart best time manage time app",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "In general a great up but today i just realized some strange behaivior on my samsung galaxy s8. The phone layed in my van the entire day but still shows me 15h of screen on time. I think samsungs always on display which shows the clock and basic notification is triggering the app to record scree...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "App does what it says. I rely more on the app usage times rather than the overall device times as I use some apps for work. I do wish / request that I could see the app usage times for previous days as often I check it before I go to bed which can be after midnight and then I've lost that days a...\nFull Review",
    "themes": [
      "Detailing"
    ]
  },
  {
    "review_description": "Don't understand why it is so difficult to create an account. Tried to do that last hour but this is impossible. It says \"i/o failure\"! This is too hard. I gave up! Uninstalled!",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "A perfect app it gives you the time that you spent on your device and the number of your pickups and can help you set goals ... A perfect app love it",
    "themes": [
      "Statistics",
      "Awareness"
    ]
  },
  {
    "review_description": "Best app for controlling yourself from using social apps",
    "themes": [
      "Self Monitoring"
    ]
  },
  {
    "review_description": "The app is not tracking correct usage of the device. My time on apps and device are totally different. Also daily limit doesn't show proper usage. I have crossed my daily limit many times, but it still shows I have some time left. Please fix this bug.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "For some reason it says I'm active constantly when my phone charges and I am sleeping. Have S9 plus now and same problem with my S7 edge.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Good layout and easy to use however it does not show the correct time i have spent on my device which affects my set time limit as it always says ive spent less time on my device than i actually have, is there some way of fixing this?",
    "themes": [
      "Easy to Use",
      "Bugs"
    ]
  },
  {
    "review_description": "I like the app but my time is at least doubled in comparison with Space and a total time of apps usage gives me only half what 'on your device today' reports. I'm on S8, please fix and I'll get rid of Space :-)",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I think it's registering the time my phone is charging as usage time or at least while I sleep it says that I use the phone so it will be nice to fix that.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "The app time and time i was on my phone didn't match up. Please track my time correctly.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Can't review the app usage of any day other than today",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Uses to work fine and last week did not monitor for 4 days?! What happened????",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Awesome app! The time counts very precisely.",
    "themes": [
      "Accurate"
    ]
  },
  {
    "review_description": "Looks great. But crashes all the time on my Pixel.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It is really helpful.",
    "themes": [
      "Useful"
    ]
  },
  {
    "review_description": "Wonderful App!! To name few Features like Control , Notification, Graphs (Insights) are greatly designed and is really good work done!",
    "themes": [
      "Statistics"
    ]
  },
  {
    "review_description": "Excellent graphical information in addition to only data Shows and make you aware of the degree of indulgence Up to the user to take next step",
    "themes": [
      "Awareness"
    ]
  },
  {
    "review_description": "A great app for digital dieting..... A true and factual insight on our daily dependency on phone",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "I compared this app vs two others for device usage tracking. Sadly while this UI looks sweet it was inaccurate by hours compared to the others. So I Uninstalled it. And yes I made sure my app killer wasn't killing it in the memory.",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "Wow so good man you just got my phone confiscated",
    "themes": [
      "Unplug"
    ]
  },
  {
    "review_description": "Boring. Confusing. Highly inaccurate.",
    "themes": [
      "Bugs",
      "Design Flaws"
    ]
  },
  {
    "review_description": "Great idea, just in need.",
    "themes": [
      "Good Idea"
    ]
  },
  {
    "review_description": "Brilliant app. Would love if we can get the times for each application",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "my new favourite phone use tracker!",
    "themes": [
      "Statistics"
    ]
  },
  {
    "review_description": "I would love to have a notification at the top saying how many times you check and also setting goals like remind me when I check it 20 times or something like that. Other then that it's a good idea... Definitely going to use this app",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Ok. I like that it doesn't consume my battery and it has a simple interface. But Checky is too simple. I can't export my data, and it doesn't appear to save data for very long. Overall, not excellent for long time data tracking and analysis. I will look for another app to track this.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "very poor application and useless,it doesn't show how many time's i hhave used my phone.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I appreciate the concept. It's helped me not unlock my phone 100+ times every day, cause I check the app periodically now.. But I wish there were goals to set and logs to show often I checked my phone last since I've had the app installed so I could really track and relax with how often I check my p...\nFull Review",
    "themes": [
      "Good Idea",
      "Add Features"
    ]
  },
  {
    "review_description": "Doesn't work....Checked my phone about 15 times and it still came up as I checked it once",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It wasn't very accurate. i looked at all the reviews, and most of them said the app wasn't so accurate, but i tried it out anyways, just to see, but it turned out they were right",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It's not at all accurate. I checked my phone since morning like 50 times. But in the afternoon when I opened the app it showed 0. Didn't work for me.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Great idea but if like most people your notifications turn up on your home screen then it's not really accurate it just tells u how many times you turn actually unlock your phone and go on it",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "Only work's when u unlock your phone I check my phones numerous times a day without unlocking it.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Doesn't work properly. Shows wrong counts.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It doesn't calculate how many times you have check your phone. Just waste of time.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "i think there should be some more opt. like to off the phone after checking a certain no. of times then it is more useful.Simply by seeing how many times i hv used my phone dont keeps my phone away from me.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "It is a very simple app and it only tells you how many times you check your phone very bad app",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "After a whole day of using my phone it still said I checked it once. Doesn't work...",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "A 'check' only adds to the total once you unlock your phone, not when you just turn it on to check",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "This app is no longer working on my HTC, but it used to work perfectly.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Only takes count when you unlock your phone and sometimes not even then",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "The info is It's not real 16 times in 1 day i check it again and again, it was always the same amount",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It works but everytime I open my phone, it counts as 2",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I love it I went up to um...43 times,yes I am obsessed lol",
    "themes": [
      "Awareness"
    ]
  },
  {
    "review_description": "wrong counting fake app",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Doesn't count anything on my device unless I remember to keep it running :(",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "After I checked my phone about 50 times it said 4...",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Not showing correctly",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "What would I do Without This App?",
    "themes": [
      "Useful"
    ]
  },
  {
    "review_description": "It doesn't show true check times.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It's counting 1 unlock phone as 2 unlock's",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Did not work for me. The count does not go up.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Never tells the right count..no use😡",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "6mb data send for one day?",
    "themes": [
      "Performance"
    ]
  },
  {
    "review_description": "Not showing true activity",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Setting goals would make the app more interesting. It is a great app.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "One of the Best concept",
    "themes": [
      "Good Idea"
    ]
  },
  {
    "review_description": "Shows correct data",
    "themes": [
      "Accurate"
    ]
  },
  {
    "review_description": "It was great, very accurate 😚",
    "themes": [
      "Accurate"
    ]
  },
  {
    "review_description": "Does exactly what it says it does. Also, I use my phone a horrifying amount. Now I have some metrics to work with, hopefully I can start reducing the pointless unlocking at staring at my phone I've been doing!",
    "themes": [
      "Awareness",
      "Impulse Control"
    ]
  },
  {
    "review_description": "Update kills screen time tracker",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Giving 4 star to get dev's attention. App is good, but there is a problem, when the phone's screen is on continuously and the date changes, the app stops recording the time. It only records when the phone is locked and then unlocked on the next date. I hope you understand my problem. Apology for bad...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Needs a lot of improvement. Many a times it doesnt record what u are doing. And sometimes record less time as compared with for the real time for which app is used",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "it sometimes doesnt register when the screen turns off, eg. i go to bed then check the phone next morning and the app shows me 7 hours of screen on time...",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Love the simple layout. Could you make the dialog asking for app permission, have a never ask again option? I only want the app for screen on time tracking. Also would like a simple widget with maybe a % of goal feature. That way I can work on lessening my time.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "It stops working when the date changes...looking for the settings if there is a way to fix this but nothing..im looking for this kind of app to check my app usage and specially screen on time, hopefully you can fix this or at least give us an option when to turn on or off the app...",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "1 day it claimed that I used the phone for 15 hours (ridiculous bc i hadn't charged since morning and had 29%still remaining) and the next day it said that I didn't use it at all! 😦",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Amazing app.. simple and does it job well... now i can now how much time i spend for youtube, olx etc etc",
    "themes": [
      "Statistics",
      "Easy to Use",
      "Awareness"
    ]
  },
  {
    "review_description": "The phone usage app only worked whole my circadian rhythm app was off, which lead me to un-install the app.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Great to see exactly what I spend/waste my time doing on my phone, but since I installed, the screen usage tracker only works after I restart my phone. Otherwise it will go a few days of \"0s screen usage\". The app usage tracker still works though. Fix? Samsung Galaxy s6.",
    "themes": [
      "Statistics",
      "Awareness"
    ]
  },
  {
    "review_description": "It just stopped working all of a sudden.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Works well, uses little battery power and has nice stats and most importantly DOES NOT BUG ME WITH ADS AND MONEY 😄😄😄",
    "themes": [
      "Statistics"
    ]
  },
  {
    "review_description": "Nice and simple. However the Apps Usage section is not displaying any information at all. Why so? Half the functionality of the app gone!",
    "themes": [
      "Easy to Use"
    ]
  },
  {
    "review_description": "Does the job well. Could do with a better UI",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "It was working well but not since the last update. Now there is no screen useage data. Please fix as it was a great app.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "The stat list is good",
    "themes": [
      "Statistics"
    ]
  },
  {
    "review_description": "I was about to give 5* but then noticed it doesn't track the time used on whatsapp video chat...",
    "themes": [
      "Statistics"
    ]
  },
  {
    "review_description": "Is there a way to back up the data collected?",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "It sometimes stop working, rest is good",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It also count background process",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Fine but counts music/audio as screen time even when screen is off but music playing.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Non-intrusive, records app usage, session#, phone time",
    "themes": [
      "Statistics"
    ]
  },
  {
    "review_description": "Was ok at first when I downloaded yesterday. Then this morning went to open an app I had used most of the day yesterday for work and the app Icon was gone. In fact the apps I did use were gone from screen but still shows up in app manager. Deleted from my screen. Not very happy.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "New update broke it, now it doesn't record overall screen usage",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "\"If you need to use the apps restart the phone\". Really? Really?? I need an effective block not a \"restart your phone and you have no blocks\" kind of solution. That and the fact that you can only choose up to 12 hours (but not 11 hours surprisingly) of block time makes me give this app a 1 star rati...\nFull Review",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "Full version doesn't work as it supposed to",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Do not upgrade, whatever you do. The advanced scheduling functionality does not work, as other users have pointed out. It works fine if you do a manual block. But the scheduling feature is not linked up to any blocking capability for some reason. It just isn't. I went through all the possible ...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Pro upgrade doesn't function",
    "themes": [
      "Price"
    ]
  },
  {
    "review_description": "Pro version is defective. I paid for the pro version purely to be able to set timed lock-outs. I usually apply a 90min lock-out in the morning but at the end of the period, it often locks out for a further 90mins and occasionally at random. I had a scheduled lock-out from 7:00am to 8:30am today and ...\nFull Review",
    "themes": [
      "Price"
    ]
  },
  {
    "review_description": "Free version worked well, wanted to get more productive by scheduling sessions so it would automatically be on during my working hours but it sometimes turns on and sometimes doesn't. At first I thought it might think it was a different day, now I just think it doesn't work right. Don't upgrade to p...\nFull Review",
    "themes": [
      "Productivity"
    ]
  },
  {
    "review_description": "Perfect for anyone with ADHD, but can be bypassed.",
    "themes": [
      "Addiction",
      "Bypassable"
    ]
  },
  {
    "review_description": "Don't spend money on this! Although the normal locking function is great, don't pay extra for the schedule. I have been trying for weeks to get it work properly. It always locks at random times, or fails to lock. Out of 30+ attempts I have never been able to get the scheduler to work.",
    "themes": [
      "Price",
      "Timers & Blockers"
    ]
  },
  {
    "review_description": "Needs more aggressive locks",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "Excellent app, but it isn't picking up some of my installed apps and therefore automatically blocks them (Skype is one). It's also locking Android Pay even though it picks it up in my app list and it isn't checked. Hope to see this fixed soon!",
    "themes": [
      "Timers & Blockers",
      "Bugs"
    ]
  },
  {
    "review_description": "Basic version is pretty good. The pro feature widget is not functioning well. I am unable to set the time when starting from widget, it seems to use a different setting than starting from within app. And it is reentrant, i.e. after a while, the widget can be pushed again, and I could have two ClearC...\nFull Review",
    "themes": [
      "Price",
      "Bugs"
    ]
  },
  {
    "review_description": "Amazing, it helps me with my revision as i use quizlet and with this app, it helps me not to use youtube or my games. It help me to focus. A few things you should add is able to add breaks so for example is after 30 minutes you could have 10 minutes break to check social media or play some games etc...\nFull Review",
    "themes": [
      "Time Management",
      "Focus",
      "Add Features"
    ]
  },
  {
    "review_description": "Sometimes the lock stays locked for 40+ min too long",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Wish it could block calls",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "I dislike that while you are able to select a start time, the end time can only be set by choosing a duration, which is rounded up to the nearest hour once you hit 4 hours. What happens if a user wants to block something for 4h 15min? This reduces the app's usability and creates extra hassle for the...\nFull Review",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Works when it wants to",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Good app but can be circumvented",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "If you want save yourself from destroying your life due to distractions caused by YouTube, Chrome or any app for that matter, this is it. It's for FREE. It saved me from becoming a complete failure in life. May you guy achieve better success. The only thing is if you could make the app more interact...\nFull Review",
    "themes": [
      "Addiction",
      "Self Monitoring",
      "Feeling Better"
    ]
  },
  {
    "review_description": "This app was wonderful until it just stopped adhering to the schedules. My daily morning schedule is completely ignored and my every Monday schedule is randomly applied on non-Mondays. Happens even on a new phone. Real shame since I really loved this app.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Everytime I try to give the app permission the settings crash and I can't seem to find a way to enable it manually since the app has no permissions to enable in the app settings. Using a Galaxy S7 Edge with the newest update.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Great for detox but schedule sometimes messes up",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "I really like the app. The only thing that could be better would be a more flexible setting for the duration of the blocking. For example: You can set the duration to 10 or 12 hours, but not to 11.",
    "themes": [
      "Good Idea",
      "Add Features"
    ]
  },
  {
    "review_description": "Do not buy the upgrade. Manual locking works fine except when it decides to force close apps that are NOT on the block list. Scheduling doesn't work at all. App hasn't been updated in two years, developers don't respond to emails.",
    "themes": [
      "Bugs",
      "Price"
    ]
  },
  {
    "review_description": "Went pro on my phone, but when i installed it on my tablet, it wont let me go pro. It says an error occured and that i already purchased it. But it wont let me schedule times/use pro on tablet even though it says that.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "This app used to be great. Now it doesn't even block any of my apps when I manually block. I uninstalled and reinstalled but that didn't help. Tried to go into my settings to turn on permission for the app and there are NO permissions for the app. What a bummer because I did really love this app.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Need something. Very easy to use. I really need need this app because of my clash of clans game i have a habit to do attract so I try to control myself but it's not work so I found this app. BUT THERE IS A PROBLEM we can block a app for max 12 hours I need in days make a opinion for 5 days pls do a ...\nFull Review",
    "themes": [
      "Easy to Use",
      "Break Habits",
      "Add Features"
    ]
  },
  {
    "review_description": "Schedule is broken",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "The upgrade time scheduling doesn't work",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I really like it and it helps me alot",
    "themes": [
      "Useful"
    ]
  },
  {
    "review_description": "it's good. Just that it would be better if we can decide the duration in hour and minute (instead of just hours). Really want to set my timer for 25 minutes (collaborate with Clearfocus 25 minutes). If you add this feature into this app, then I will donate (buy the pro version) as a sign of my supp...\nFull Review",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Works well, but it does automatically select some apps (Skype, messaging) so be aware that you may not have 100% control over every app that shuts down. Also allows for notifications during lock out, which would be nice to be able to turn off. For now I'm using it in tandem with another blocking app...\nFull Review",
    "themes": [
      "Unrestrictive"
    ]
  },
  {
    "review_description": "Notifications are still distractions",
    "themes": [
      "Design Flaws",
      "Unrestrictive"
    ]
  },
  {
    "review_description": "App is good but I am not able to use the app in appo f1+.. as the app permission requirement is not fulfilled and not located at driven place of settings... Pls help.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Uh I don't know whether it's my phone or the app but it shuts down my Chrome even when it wasn't ticked in the list of apps to lock. Also, Clash of Clans and a lot of other apps can still be accessed even though I had checked them to be locked.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Nice app. I was too much addicted to my phone it totally distract me by closing addicted app. Thank you. 😊",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "Simple to understand kind of app. I could have given 5 stars but I am not giving because it would be better if there is a feature added which along with the existing system allows user to set a similar restriction on particular app. What I mean to say for example on app x I want to put different...\nFull Review",
    "themes": [
      "Easy to Use",
      "Add Features"
    ]
  },
  {
    "review_description": "Not blocking any app, I'm on xiaomi redmi 3s",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "This does what I wanted (block for x after using for y) but the interface is totally insane and inconvenient. It doesn't allow you to set usage time per app. Why? Why make this app so useless and hard to control?",
    "themes": [
      "Timers & Blockers",
      "Timers & Blockers",
      "Design Flaws"
    ]
  },
  {
    "review_description": "I cant even use an app for more than 5 minutes wow!!! Very good ,keep it up and i am uninstalling this app. Who will play coc for 5 min at least give us about 10 minutes",
    "themes": [
      "Lack of Freedom"
    ]
  },
  {
    "review_description": "This is exactly what i had been looking for all these days.thanks for making this app.....and keep making such good apps which are helpful to students☺",
    "themes": [
      "Productivity"
    ]
  },
  {
    "review_description": "It's really Nice it helps me study. Highly Recommended 👍",
    "themes": [
      "Studying"
    ]
  },
  {
    "review_description": "I am able to study well",
    "themes": [
      "Productivity"
    ]
  },
  {
    "review_description": "This is awesome. Not only blocks the apps, but to unblock them, you need to copy some lyrics of popular songs. ♡",
    "themes": [
      "Timers & Blockers",
      "Restrictive"
    ]
  },
  {
    "review_description": "The apps are still working on my phone Useless app",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I really like the idea and it works well! my only complaint is that the app usage time is too short! id advise to make it up to 30 minutes or at least 20 for more choice. otherwise great job!",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Works for me . But hey i would appreciate If you add a way so that we can check how much more time we can open app . Like if i set 20 mins permitted time . It should show that 5 mins are left . overall its great . Does what it is suppose to do .",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Didn't work well on my device.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Scheduled locking is not working. I ve given all the permissions required,unchecked app from battery saver, gave auto sart and start in background permissions as well. Another bug is locking persists even after the schedule is over and if two such schedules intertwine number of unlocks left is f...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It used to work best. But now it doesn't lock the phone for the specified time. After 5-10 minutes bashful gets disabled.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Changed the way I use my phone. Earlier I would unmindfully fiddle with my phone constantly. Now I take a moment to unlock and quickly do what I need to. No more phone addiction.",
    "themes": [
      "Impulse Control",
      "Self Monitoring",
      "Addiction"
    ]
  },
  {
    "review_description": "It made me focus ! Definitely I don't write reviews for every app I use but this is exceptional and specially the 20 sec breakfree , just love the idea , no other has it like this . Dev team , keep it up , Love it 👌",
    "themes": [
      "Focus",
      "Good Idea"
    ]
  },
  {
    "review_description": "Good app. One suggestion, make app exceptions that can be used.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "What if someone tried to uninstall or force stop this app in those 20 seconds. Please have a look.",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "Excellent app for improving my willpower against smartphone and screen addiction",
    "themes": [
      "Addiction",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "Loved it 👏👏👏 (literally the best in the play store ) . But I would like to suggest some features which I personally think are necessary. 1)PREVENT APP UNINSTALL.There have been many occasions that I have uninstalled the app before the time I had set it to.2) PREVENT PHONE TURN OFF. It is quite e...\nFull Review",
    "themes": [
      "Bypassable",
      "Add Features"
    ]
  },
  {
    "review_description": "The app is great. But would recommend giving the pro features for free. That will be really helpful. We really want it! We love the app",
    "themes": [
      "Useful",
      "Price"
    ]
  },
  {
    "review_description": "The overall idea is good... And I really wanted to give it five stars. But this app has a loophole. When the app is active if we press the recent menu button, it will get minimized and we can remove the app by clearing all the recent apps. You guys, your idea is awesome and I loved it. Please work...\nFull Review",
    "themes": [
      "Good Idea",
      "Bypassable"
    ]
  },
  {
    "review_description": "Almost perfect. This is the best phone use-blocking app I've used to date. While it is still possible to access my phone, Bashful makes it sufficiently annoying so that I don't bother trying to unlock it. I just wish it had a little more customization. In addition to how many times I have to hold do...\nFull Review",
    "themes": [
      "Timers & Blockers"
    ]
  },
  {
    "review_description": "This is a nice idea ..... But we can easily close this app by pressing that blue button we will get 20 sec. Now if we pull down the status bar and go to settings then open apps option in settings then select bashful then force stop it.Please fix this ...!!!",
    "themes": [
      "Good Idea",
      "Bypassable"
    ]
  },
  {
    "review_description": "I gave a 5 star in the initial review, but now I'm giving a three because upon testing I realized that it's too easy and doesn't have essential features. If im actually procastinating, I could just simply press and hold the back button on my phone to force close it, or open the recents menu and swip...\nFull Review",
    "themes": [
      "Add Features",
      "Bypassable"
    ]
  },
  {
    "review_description": "This is an excellent concept. But the problem I'm facing is when I clear my ram (during the unlock time which it provides i.e 5 for default), it kills the app. Not sure if it's coz of MIUI or the app itself. Kudos for the brilliant concept though.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Include password unlock and also selective lock to certain apps only based on the frequency/addiction of usage. Also allow not just receiving phone calls but also making phone calls.",
    "themes": [
      "Bypassable",
      "Add Features"
    ]
  },
  {
    "review_description": "Brilliant app. But can it be made more strict, I mean there is no option to unlock for defined time(may be optional to user). There are many loopholes like in recent screen you can remove it, you can also get notifications and read it and force stop it at any time",
    "themes": [
      "Unrestrictive",
      "Bypassable"
    ]
  },
  {
    "review_description": "Renders useless since one can 5 second disable. Looking for something more aggressive",
    "themes": [
      "Bypassable",
      "Unrestrictive"
    ]
  },
  {
    "review_description": "It's a great app and concept. There are two things missing a timer to tell me when the block is up and the fact that I am able to uninstall the app in under 20 seconds",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "That's great to avoid loss of time because of app addiction but I'd suggest to add somewhat notification alert when the countdown ends. In this way, we could use it as pomodoro-like app too :)",
    "themes": [
      "Time Management",
      "Addiction",
      "Add Features"
    ]
  },
  {
    "review_description": "It's a really helpful app and as the name suggests 'stop procrastination' it helps helps in doing that too but I'm giving 4 star because I feel the lack of a schedular which could schedule lock timer and breaks, would be gud if the developers give a new update which could schedule it according to 'p...\nFull Review",
    "themes": [
      "Useful",
      "Add Features"
    ]
  },
  {
    "review_description": "Great app ...but please include scheduled lock option so that my phone will get lock on particular time ... Please",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Worked well and was straight forward to use. Looked nice and was effective in time out situations. Thanks.",
    "themes": [
      "Easy to Use"
    ]
  },
  {
    "review_description": "While the app is good, the blocks aren't auto-enforced but have to be enabled manually by opening the app. Is there any feature that ensures auto-blocking of the app?",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "Simple but brilliant works straight away no messing around you can unlock it for 20 seconds and choose how many times you can do that",
    "themes": [
      "Impulse Control"
    ]
  },
  {
    "review_description": "the app is so awesome that i had to unlock thrice just to write this review.... and also found that you can unlock just by rebpoing the device.",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "Wish i could set an automatic time each day that this turns on",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Bug Found: The app can be closed by clearing it from the recents.",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "A really clever app to force your phone aside while studying.",
    "themes": [
      "Studying",
      "Unplug"
    ]
  },
  {
    "review_description": "Perfect for forcing myself off my phone when it's time for bed. 👍",
    "themes": [
      "Sleeping",
      "Unplug"
    ]
  },
  {
    "review_description": "It's surely a bug",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Awesome concept! Keeps me focused.",
    "themes": [
      "Good Idea",
      "Focus"
    ]
  },
  {
    "review_description": "Good app just need one more thing to add unlimited times in no of times until bashful is disabled. After 20 the app must also provide do not disable. And at the end of the session app provides the number of times bashful was disabled for 20s in the session",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "The concept of this app is great but it has a major loophole which makes it completely useless to me: you can simply restart your device and the block goes away. So, unfortunately, I had to uninstall it. Please add a feature to automatically resume the block after a restart, then this app would w...\nFull Review",
    "themes": [
      "Good Idea",
      "Bypassable"
    ]
  },
  {
    "review_description": "Terrible loophole. You can uninstall it easily during the 20 second unlock.",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "I get the idea. But it didn't hsve a timer. Also it didn't give me any notifications after the time was up. Notification wasn't disabled.",
    "themes": [
      "Good Idea"
    ]
  },
  {
    "review_description": "It stops in between of session 🙁",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I liked this app before, but the strict mode (as it is now), makes it useless for me. I want a charger lock for my profiles, but definitely not for my device settings. I wish there were a way to separate those two functions, at least set different locks for profiles than for device settings.",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "This app is my lifesaver! I've been looking for an app to limit my phone usage for a long time. Even after deleting social media apps etc I was still finding myself going on them through the browsers.. aka no self control. The location feature is really useful & I'm able to limit my family's usa...\nFull Review",
    "themes": [
      "Feeling Better",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "Good to keep us away from our phone. But could've been better. The free version comes with toooo many restrictions. Would've helped alot if a little more apps and slots were allowed than just 5 and 3 respectively ( in the free version)",
    "themes": [
      "Unplug"
    ]
  },
  {
    "review_description": "Honestly it's exactly what I need but it still deactivates after idling and there's too many restrictions in the free app.... At least give us more apps per profile in the free app. Oh and if it helps I use a MI phone if that's the cause of the idling bug.",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "I'm using the pro version for last couple of months and it was working really well. I even recommended it to a few friends. After the recent app update, the notifications start popping up despite blocking notifications. So it's distracting. Before the app update, notifications didn't pop when th...\nFull Review",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "This app works on a really nice idea. But the problem is that it is not working fine on my phone. The apps are blocked initially, but it seems that after the phone is left idle for some time, the block is removed and all the apps are accessible. It seems that the phone's system hibernates this a...\nFull Review",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "This app has been a lifesaver. For so long, opening my phone and checking distracting apps became a habit. This has given me a way to create a sense of awareness and keep me productive and on track. The long mornings I used to waste in bed scrolling through my phone are a thing of the past. Anyon...\nFull Review",
    "themes": [
      "Feeling Better",
      "Break Habits",
      "Awareness",
      "Productivity",
      "Focus"
    ]
  },
  {
    "review_description": "It does what it promises. The profile lock is a particularly nice feature, and I found it very useful when I had the odd productivity spurt and didn't want to lose my groove. UPDATE: the app does not work in background.",
    "themes": [
      "Timers & Blockers",
      "Productivity"
    ]
  },
  {
    "review_description": "This app blocker is too easy to bypass, all you have to do is uninstall it. Not even setting it as a device administrator makes it any more difficult to override it, since most people only have one active profile on their phones - precisely the administrator profile. (2018/07/03)",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "An excellent app to ensure that distracting apps are blocked during days and times as specified by the user. In my personal capacity, I have seen a great deal of improvement in my productivity and a positive impact in app addiction",
    "themes": [
      "Timers & Blockers",
      "Productivity",
      "Addiction"
    ]
  },
  {
    "review_description": "The app automatically closes when it should not. This is a very big problem",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "My exams are over, I needed it before but now I don't and it was decent, it did the job. Problem - you cannot delete the app so it's taking up space on my phone.",
    "themes": [
      "Studying"
    ]
  },
  {
    "review_description": "Great app.... But there seems to be a serious bug. It stops blocking apps after sometime and you can access blocked apps..",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "One more feature needs to come. For the time, you should be able to set it to let you use an app for, say, 30 minutes per day. Instead of being allowed to use the app from 5:30-6pm, allow the user to have the app open for a cumulative 30 minutes. If you make that feature, this will become 5 star...\nFull Review",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Love this. It successfully holds me away from social media that make me waste tons of time when I should be studying.",
    "themes": [
      "Time Management",
      "Self Monitoring",
      "Studying"
    ]
  },
  {
    "review_description": "Love love love it! helped me from my online shopping addiction and now I'm able to do schoolwork better",
    "themes": [
      "Addiction",
      "Studying"
    ]
  },
  {
    "review_description": "App Block is NOT a data saver. App does not mention anything about data usage control. This is an app usage control app only. I bought the app expecting app profiles for data usage, but I'm keeping it because its too useful for guarding my productive time.",
    "themes": [
      "Productivity"
    ]
  },
  {
    "review_description": "It's not systematic... Didn't work for me..wasted money paying for it",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "This app doesn't work. Have blocked some apps, it seems this app forgets to block those apps.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Exceeds expectations.... Far better than what I expected... Great productivity application...help you keep away from addictive social applications and help you to work on productive things in life... Great job by creators... Thanks",
    "themes": [
      "Productivity",
      "Addiction"
    ]
  },
  {
    "review_description": "useless....I can not delete it now? support please help me to remove your app.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "i give 5 star if add new codition when open apps i can disable notif so can add when times, location, wifi and when open apps",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "It does what it's supposed to but it's blocking all of my other notifications as well.",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "I paid for this app! But didn't work upto my expectations!",
    "themes": [
      "Price"
    ]
  },
  {
    "review_description": "Worst app tried today! And it's not working!",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Too many restrictions in free mode destroys the app",
    "themes": [
      "Price"
    ]
  },
  {
    "review_description": "It's frustrating because it's an app made for breaking habbits, however, it's great because it works flawlessly!",
    "themes": [
      "Break Habits"
    ]
  },
  {
    "review_description": "Great app for keeping in control of the dangerously addictive apps that are around, I'm using pro version on a S6.",
    "themes": [
      "Self Monitoring",
      "Addiction"
    ]
  },
  {
    "review_description": "This helped me a lot to cease from opening applications that lead me to procrastination thus creating my day a lot more productive....",
    "themes": [
      "Productivity",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "What if I delete appblock? Then I have access to my apps? Or is it restricted also from deleting the app while in block mode?",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "when it blocks its good but 40% of the time it doesnt work, only if i open the app and leave it open in recent apps",
    "themes": [
      "Bugs",
      "Bypassable"
    ]
  },
  {
    "review_description": "Changing previous review after issue fixed. Best option on the market but still room for improvement",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "This is the best app i ever seen i use it for control my phone usage like so much and thank to devaloper😀😀😀😀🤣😂😃😄👍👍👌👌",
    "themes": [
      "Self Monitoring"
    ]
  },
  {
    "review_description": "Most productive app made for those seeking abstinence from apps eating up their valuable time",
    "themes": [
      "Productivity",
      "Time Management"
    ]
  },
  {
    "review_description": "I think the time lock should have an upper limit, I just locked one app for 9999999 days What to do ???",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "complicated app dont know how to use it",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "It is not active on rom xiaomi",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Range blocked is 18-23, but it blocks at 8am. And profile cannot be deleted but archieved.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Simple and clean. The 5-app limit in the free version is enough for me to block the internet and Instagram. Love it.",
    "themes": [
      "Easy to Use",
      "Timers & Blockers"
    ]
  },
  {
    "review_description": "Best app for everything it's improving I don't Mony preum version but still it's live saving app",
    "themes": [
      "Feeling Better"
    ]
  },
  {
    "review_description": "It works and helps you stay off your phone. Honor your lock don't turn it off",
    "themes": [
      "Unplug"
    ]
  },
  {
    "review_description": "This apps help to improve our productvi and avoid social media This apps is good for compatible asprints",
    "themes": [
      "Productivity"
    ]
  },
  {
    "review_description": "Its very helpful in reducing distractions",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "Helps me pass my classes, that's for sure.",
    "themes": [
      "Studying"
    ]
  },
  {
    "review_description": "Pls add block uninstaling option",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "Finally I can escape Instagram",
    "themes": [
      "Unplug"
    ]
  },
  {
    "review_description": "Why the heck do I have to give up my email address just to use this?! All I want is a timer to lock my phone for a while. Not yet another app that I have to log in to and remember a password. For what?? To lock my phone?? Stupid.",
    "themes": [
      "Privacy"
    ]
  },
  {
    "review_description": "Offtime is a better app U can choose apps u want to lock...unlike flipd which blocks all apps",
    "themes": [
      "Timers & Blockers"
    ]
  },
  {
    "review_description": "Really I like to say thanks for you..it's a very nice and useful app 🌸🌸💓",
    "themes": [
      "Useful"
    ]
  },
  {
    "review_description": "This one's so cool and so helpful Great job, app developers.",
    "themes": [
      "Useful"
    ]
  },
  {
    "review_description": "This app is honestly so helpful when it comes to me needing to focus on my school work instead of checking the latest posts on facebook/instagram. I definitely recommend this app to anyone who struggles to put their phone down for an hour or so.",
    "themes": [
      "Useful",
      "Studying",
      "Focus",
      "Unplug"
    ]
  },
  {
    "review_description": "What needed: Make some features to whitelist some apps which we needed to use. Problem: When I switch off and on it will not work. Overall very good app.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "It does not work after I swich off the phone and again start. I have access to everything in my phone.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Bring back whitelisted apps and you get 5 stars",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "I liked the concept and the app but there are Two issues: 1. Available applications via menu are not accessible it opens and gets hidden with lock. 2. Lock does not work with split screen currently writing this review from split screen with flipd on.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Amazing app to help you focus on your studies and get you off social media! However the free version is very simple and the premium version is very expensive for students :(",
    "themes": [
      "Focus",
      "Studying"
    ]
  },
  {
    "review_description": "This app just works like a charm and if you aim to have a completely unusable phone (apart from essential functions) for a chosen period of time, this is for you. I love it.",
    "themes": [
      "Restrictive"
    ]
  },
  {
    "review_description": "You can only stay flipped for 30 minutes without paying for premium. :-/",
    "themes": [
      "Price"
    ]
  },
  {
    "review_description": "Really good app to stay off your phone. A bit of customization would be good but I think you get that in premium.",
    "themes": [
      "Unplug"
    ]
  },
  {
    "review_description": "Must app have for students. Very simple and useful. But if u power off the cell and on it again it is gone..i hope it will be updated soon without this problem. 😊",
    "themes": [
      "Studying",
      "Useful",
      "Easy to Use"
    ]
  },
  {
    "review_description": "Useful if u need to sleep otherwise u gotta pay for add on's wich it dosnt tell you. All in all its good just be careful.",
    "themes": [
      "Sleeping"
    ]
  },
  {
    "review_description": "It's great but I have to pay for it. Could I buy and dont have to paid monthly or yearly . It will be the best app!!!",
    "themes": [
      "Price"
    ]
  },
  {
    "review_description": "Very happy with this app, its been a big game changer in staying away from my phone",
    "themes": [
      "Unplug"
    ]
  },
  {
    "review_description": "Overall it's nice, but wish it had separate app blockings. And more efficient locking. It can be bypassed somehow.",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "Best digital well being app ever! I hope it comes to Mac and PC soon. Also their is a bug which disallows me to open Phone app in full lock mode on One Plus 6.",
    "themes": [
      "Other Devices"
    ]
  },
  {
    "review_description": "It is the app I stuck with the most time for focussing",
    "themes": [
      "Focus"
    ]
  },
  {
    "review_description": "Nice way to be free from distractions!!",
    "themes": [
      "Focus"
    ]
  },
  {
    "review_description": "Best app for student😂",
    "themes": [
      "Studying"
    ]
  },
  {
    "review_description": "Great tool to focus and get down to your work. Made me more aware of how i am really working and how much i \"think i was working\". Prevent distractions and shows you how poorly you are using your time in general - reaching for the phone every few moments.",
    "themes": [
      "Focus",
      "Working",
      "Awareness"
    ]
  },
  {
    "review_description": "Truly helps me focus on my productivity when I \"flip\" off my phone. I love this because I use hotspot from my phone to use the internet on my laptop and this app allows you to scroll down the notification bar to access those settings. But I'd request the developers to kindly activate the \"Phone\" ...\nFull Review",
    "themes": [
      "Focus",
      "Productivity",
      "Unplug"
    ]
  },
  {
    "review_description": "You may not think that this will help you... but it will. This app + good self control = a lot of work done. Trust me. This is good",
    "themes": [
      "Self Monitoring",
      "Working"
    ]
  },
  {
    "review_description": "Helps me a lot in focusing and make the best benefit of my time",
    "themes": [
      "Focus",
      "Time Management"
    ]
  },
  {
    "review_description": "I love this app. Since installing, I've been using it like crazy. I haven't managed yet to find a way around the full lock, even restarting your phone. When I was prompted to pay for premium, it was a no brainer. This app has become part of my daily routine. I think I'm now flipd off more than I'...\nFull Review",
    "themes": [
      "Blocking"
    ]
  },
  {
    "review_description": "What a joke!! 1 min into my first test of it I got 2 FB messenger messages which I replied to! Thank God I didn't pay for premium.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "If you want to stay focus this is the best app I ever used. In one word is just awesome",
    "themes": [
      "Focus"
    ]
  },
  {
    "review_description": "The app is excellent and concept behind the app is very productive. But, if there is an option to make call, it would have been much better. Because one cannot guess when an emergency comes and the app may suddenly become counter productive. Please atleast provide the option in the settings for ...\nFull Review",
    "themes": [
      "Productivity",
      "Add Features"
    ]
  },
  {
    "review_description": "Best app to stay distraction free and focused. All those who can't keep on track while studying, this is the aap 4 u. I wish app should allow access to few files which may be needed while locked up.",
    "themes": [
      "Focus",
      "Studying"
    ]
  },
  {
    "review_description": "The app is good however there are some improvements that should be made. Firstly, it should count exceeding time, for example if i lock out for 1hour but i spent 2 hours off my phone and without going on it, it will only count the one hour despite being flippd out for much longer. Also there is ...\nFull Review",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Started off using this app just to focus more in work but now use it when im with friends just so I can spend time with people I am with and not on my phone. Highly recommend if you need a break from your phone and being contactable immediately",
    "themes": [
      "Focus",
      "Working",
      "Feeling Better"
    ]
  },
  {
    "review_description": "There are a few apps I use for work that I get locked out of. Would be even better if I could choose apps to keep unlocked.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "This app is great. PERFECT for training yourself not to look at your phone all the time. I like that there are a few basic apps allowed during lock. And I very much like that the lock can't be circumvented easily. When I'm studying, this is my go to in order to help me remember that in order to ...\nFull Review",
    "themes": [
      "Self Monitoring",
      "Impulse Control",
      "Studying"
    ]
  },
  {
    "review_description": "It's really good app, BUT you HAVE TO add a setting where you can choose apps that can't be locked during a \"session\". For example, I couldn't open an emergency call from a locked screen. I think it's so important. Anyways it's a really good app, it helped me a lot! Good job! Thank you.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "When my phone restarts the app closes and says I've done my time. This isn't good for addiction because people can just restart their phones to gain access to their apps",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "It keeps automatically putting me in 5 hour timer when I click on the icon up top. I want to go to full block mode but it puts me in light mode and won't let me change it. I understand not allowing it to go from full block to light block, but at least give me the option to change to fill block.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "This app really helps me to avoid my phone when I'm trying to do schoolwork and stuff, but I wish I could flip off for more than one hour on the free version, and Facebook messenger can also display over the app which can be distracting",
    "themes": [
      "Studying",
      "Unplug"
    ]
  },
  {
    "review_description": "Amazing app...helps me focus at work, study, driving etc...couldn't recommend it more highly....changing my life",
    "themes": [
      "Focus",
      "Working"
    ]
  },
  {
    "review_description": "This app can be bypassed by android split screen.",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "In samsung enable ultra power saving mode and disble it and then force stop the app.. so we can bypass lock.",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "Its a good app for helping abstain from smartphone addiction and concentrating on studies, work, sleep",
    "themes": [
      "Addiction",
      "Studying",
      "Working",
      "Sleeping"
    ]
  },
  {
    "review_description": "Paid last year October for premium user access still not activated lose of money cheating app",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "You can easily use apps while on lock by opening them in multi window!",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "I've been trying to calm my phone usage for a while now and had considered a second dumb phone to help me. This removes the need for such a device, stripping your apps to a minimum yet retaining the helpful elements of a smartphone. As much as I would have loved to see the Siempo phone come to f...\nFull Review",
    "themes": [
      "Self Monitoring"
    ]
  },
  {
    "review_description": "I really like this app but I wish there was a way to disable the \"flagged apps\" screen. It seems counterproductive to create a shortcut to apps you're specifically trying to stay away from. Other than that I think it's great.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Wonderful app, reduces phone addiction. But bugs abound ++ makes my moto g5 plus run hot and drain battery ++ permissions loop that renders app unusable, after accidentally starting and not finishing the setup process for the notification grouping feature. ++ Please allow us to move the Intentio...\nFull Review",
    "themes": [
      "Addiction",
      "Bugs"
    ]
  },
  {
    "review_description": "I like the app but the battery drain forces me to uninstall it. I will keep checking for updates and will try again when this is addressed. Also, as others have mentioned the coming customization of tools will be greatly appreciated. I use two different notes apps and can't access them easily be...\nFull Review",
    "themes": [
      "Performance"
    ]
  },
  {
    "review_description": "The app is really great but the bugs are getting on my nerves.. 1. After I close all apps from the recents menu, it takes a great deal of time to launch this app again. Same for the home button. 2. The alarm is not working in my phone, I have to physically shut it off from the clock app rather t...\nFull Review",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Great app and works well, really like the simplicity and the concept but I have one issue: some flagged apps have completely disappeared and some apps can't be given special notification permissions from the settings, they just don't appear. Is this normal? I am aware the app is still in beta so ...\nFull Review",
    "themes": [
      "Good Idea"
    ]
  },
  {
    "review_description": "Okay, all of my expectations have been met, and I can see the hard work in it. But.... I've purchased a new smartphone, it's a more modern on, and it has a 18:9 aspect ratio, and when I swipe right for the app drawer, I now have a gap at the bottom, where the navigation bar would be, but since my...\nFull Review",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Dropping my score from 5 to 3 stars. This launcher had gotten very laggy and does not register some of my homescreen swipes.",
    "themes": [
      "Performance"
    ]
  },
  {
    "review_description": "I've been using this for three hours now. I can already tell it's going to stay on my phone. In just the last few hours, I've been made aware of how often I reach for my phone and then cycle through the same five apps looking for hits. Instant relief.",
    "themes": [
      "Awareness",
      "Feeling Better"
    ]
  },
  {
    "review_description": "The only problem i have with it is that it crashes something.... but despite of that fact it really help me keep my smartphone away",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Simple, clean, and minimizes distractions. Love the intention setting piece too.",
    "themes": [
      "Easy to Use"
    ]
  },
  {
    "review_description": "BEST LAUNCHER EVER. useless addictive apps eat away our time, yet they also carry a degree of necessity - as an adjunct to our social life. this app keeps usage in moderation.",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "An amazing well developed app that allows you to break away from your phone. Best app I have.",
    "themes": [
      "Unplug",
      "Impulse Control"
    ]
  },
  {
    "review_description": "Needs Work. please add calculator in the tools section.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "I love the idea behind the app.",
    "themes": [
      "Good Idea"
    ]
  },
  {
    "review_description": "Helps me a lot with my digital well-being. I recommend this as a standard to avoid cellphone addiction. However, setting a background image doesn't work for me. It just keeps loading, how to fix this?",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "Achieves exactly what it says - will help you be more concious of wasting time on your phone. Regular updates have fixed issues. Keep up the good work!",
    "themes": [
      "Awareness",
      "Time Management"
    ]
  },
  {
    "review_description": "I really like the idea for this app. It helps to curb phone addiction, although I really wish you could add your own tools and that you could make the home screen turn black at night.",
    "themes": [
      "Good Idea",
      "Addiction",
      "Add Features"
    ]
  },
  {
    "review_description": "Wonderful idea! Really helps in keeping me from randomly looking for something to do on my phone. Looking forward to watching this Launcher develop.",
    "themes": [
      "Impulse Control"
    ]
  },
  {
    "review_description": "Seems like a good idea. But needs the ability to add your own tools. I have many apps I use daily as part of my work and need them to be on the home screen.",
    "themes": [
      "Good Idea",
      "Add Features"
    ]
  },
  {
    "review_description": "Great app. Wondering if there will be slight design additions in the future. Would love simple intentions typography choices to really make it bold and maybe strong red masks or self-written messages over the flagged apps to push you away. Thanks for making this!",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "This app changes your life! -Hooked on a mobile game? Add it to your \"bad app\" list and you'll slowly be reminded that it is controlling your life. - Do you check your phone for every notification, have it set to batch notifications so you don't have to do it every minute. - Do you mindlessly fl...\nFull Review",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "App is great! Love the updated features and really reduces the time I spend distracted on my phone. Simply debrabding apps or making them harder to find makes them less routine to get distracted. I would love to see the intentions box be movable, it covers the middle of my screen which covers up...\nFull Review",
    "themes": [
      "Time Management",
      "Break Habits"
    ]
  },
  {
    "review_description": "It's not perfect yet but I feel like it's found a good balance between a gentle reminder as well as being intrusive. It has improved by leaps and bounds since launch and really has help improve my productivity at work and at home. Will continue to use and look forward to Future improvements and ...\nFull Review",
    "themes": [
      "Productivity",
      "Working"
    ]
  },
  {
    "review_description": "I recently downloaded the app, but it's currently having trouble accessing my phone permissions. It doesn't let me set it to be my home app, and many features simply can't be turned on. Can anyone help me with this? This app has enormous potential and I really hate to see it not working like this",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Wonderful! Today is day three of having Siempo. And lemme tell you, it has revolutionized the way I use my phone. I am very grateful! Pros: -Minimalistic design -Simple icons for tools and apps -Layout is awesome- Intention is main screen, then tools, then frequent apps, and then your flags -Jus...\nFull Review",
    "themes": [
      "Self Monitoring"
    ]
  },
  {
    "review_description": "This app has helped me focus and reduced screen addiction. Highly recommended.",
    "themes": [
      "Focus",
      "Addiction"
    ]
  },
  {
    "review_description": "Great app. Helps control impulsive behaviour. Developer has clearly thought things through.",
    "themes": [
      "Impulse Control"
    ]
  },
  {
    "review_description": "Its confusing to use and just not for me",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "Good app to hack your focus, get (deep) work done AND still use your phone wisely.",
    "themes": [
      "Focus",
      "Working"
    ]
  },
  {
    "review_description": "I have been waiting for something like this for a long time. However, the launcher could use some aesthetic improvements. The interface and icon set look a little bit clunky. Not sure if this was by design. It would also be cool if we could embed a task or calendar widget into our home screen, so...\nFull Review",
    "themes": [
      "Design Flaws",
      "Add Features"
    ]
  },
  {
    "review_description": "Hey Siempo! I'm really glad you're doing what you're doing! I was wondering if the app search bar could incorporate a generic web search feature as well! It would be super useful as sometimes I have to open the individual Google app to search something which makes me spend more time on my phone ...\nFull Review",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Good app, but noticed a bug. The notifications keep piling up over time. Normal notifications which could be cleared once and done, have to be clicked upon now to dismiss them. Eg. app update notifications etc. Please ensure someway to clear them",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "Effective as advertised. Im not easily distracted from my phone now. The interface is simple yet effective. It makes my screen less enticing keeping me FOCUS on my intention most of the time.",
    "themes": [
      "Unplug",
      "Focus"
    ]
  },
  {
    "review_description": "Minimalist. Super. That's a good thing for this kind of app. Basically, it's a good app. Though I have noticed it sucks up a lot of battery on my Pixel XL. I hope the developers refine the app so it doesn't suck up so much juice. Otherwise, I might just have to delete it since the battery on my Pixe...\nFull Review",
    "themes": [
      "Performance"
    ]
  },
  {
    "review_description": "Great work siempo team. 🤗 A quick question regarding notes. I seem to be struggling to open /edit any saved notes. Any ideas? Thx",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Really like the purpose of this app. It has already been making a difference. I have noticed a couple of bugs. 1. The custom wallpape r squashes photos that don't match the resolution of my phone screen. This eliminates the use of over 70% of my own pictures. 2. It took me ages to figure out how...\nFull Review",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "It was a great concept. However, it needs a lot of improvement, beta version hangs alot and is not able to perform minimum tasks that are expected.",
    "themes": [
      "Good Idea",
      "Add Features"
    ]
  },
  {
    "review_description": "It's a brilliant start and it's only in beta the only improvements I can think of is inverting the colour so that on an AMOLED screen you would be able to save battery and to add an extra or custom tool as I use text and Facebook message to keep in contact with people yet I can only have one app ...\nFull Review",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "I like the dark mode option is there. But I think, the look in dark mode is not good enough. Please make the look in dark mode simpler with fewer borders. Thanks.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "I like the idea, but there is a lot of polish needed for realisation. For example, frequen apps might be chosen automaticaly base on usage experience. It also allows you to see your habits more clearly. Will not use it right now, but keep installed just to follow new updates. God luck!",
    "themes": [
      "Good Idea"
    ]
  },
  {
    "review_description": "Really great app! A few minor bugs, but I'm sure the devs will fix them when the stable is released. 5 stars!",
    "themes": [
      "Good Idea"
    ]
  },
  {
    "review_description": "Easy way to stop using the phone when not really need to. Small issue, I'd like to be able to have web links not just apps as icons.",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "So far so good. It's a simple app. Easy to work. Only wish you needed to enter a password to uninstall. Didn't take my child that long to figure out he could do that. Would also like a button where I could add more time. The tablet he uses I also use after he goes to bed, and now I can't.",
    "themes": [
      "Easy to Use",
      "Bypassable"
    ]
  },
  {
    "review_description": "This app is amazing. I discovered it while reading the book Glow Kids. It's a great way to reduce screen time for yourself and your kiddos!",
    "themes": [
      "Time Management",
      "Parental Control"
    ]
  },
  {
    "review_description": "I love this app. I love how it forces me off my phone at nights. I love that it records app usage and differentiates entertainment apps from productive apps. Overall, its a life changer!",
    "themes": [
      "Sleeping",
      "Unplug",
      "Feeling Better"
    ]
  },
  {
    "review_description": "Great idea, but most of my apps were incorrectly categorized - I promise, quickbooks is not entertainment :) Needs the ability to change categorization.",
    "themes": [
      "Good Idea",
      "Add Features"
    ]
  },
  {
    "review_description": "Good, would be better if it tracked days and trends",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "The best parental control app I've seen out there.",
    "themes": [
      "Parental Control"
    ]
  },
  {
    "review_description": "Best app I've found at limiting screen time",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "Great product, delivers on its claims. Love the Quiet time feature - helps me kill some of that smart phone addiction very effectively! Also, very responsive team, they fixed a reported bug real quick and the App works really well now on Android",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "Very useful to tell how much time you are spending on the phone.",
    "themes": [
      "Statistics",
      "Awareness"
    ]
  },
  {
    "review_description": "Intuitive design, great application.",
    "themes": [
      "Easy to Use"
    ]
  },
  {
    "review_description": "Great app to help keep track of my family's screen time. Not just for the kids - a real eye opener to get the hard facts about my own phone usage.",
    "themes": [
      "Statistics",
      "Awareness",
      "Parental Control"
    ]
  },
  {
    "review_description": "It literally never blocked a single app. Doesn't work.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I keep getting an error \"you are not connected to the internet\"",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Fantastic app! Making the invisible, visible.",
    "themes": [
      "Awareness"
    ]
  },
  {
    "review_description": "Good app. I'd like to know how it calculates productive time.",
    "themes": [
      "Productivity"
    ]
  },
  {
    "review_description": "Great app to monitor our use",
    "themes": [
      "Statistics",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "So far, so good. Would I keep paying for it? For $5 a month? Hmmmm, is there a lower tier subscription? Also, would be great to have a notification warning about reaching Daily Time Limit or or Zen Breaks before they actually occur because I get caught off-guard and end up sliding the feature of...\nFull Review",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Couldn't even login. Never ending loop of you already have an account, resetting my password, and then getting an error when I try to login again.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Excellent app. Easy to install, easy to configure, lots of options. While for the kids this is great to instill responsibility and make them aware of their screen time, but what was eye opening was analysis of my own usage after installing the chrome extension. I had no idea how much time is was...\nFull Review",
    "themes": [
      "Easy to Use",
      "Awareness",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "Finally, a great App to track not just my kids but my screen time as well. I will highly recommend this to everyone. It is very simple and easy to use. Love it.",
    "themes": [
      "Parental Control",
      "Statistics",
      "Easy to Use"
    ]
  },
  {
    "review_description": "This is an app I would HIGHLY recommend to people that use their phones too much without realizing that they do it out of habit, like me.",
    "themes": [
      "Awareness",
      "Unplug",
      "Break Habits"
    ]
  },
  {
    "review_description": "Good app. HUGE flaw. It can be deleted from a child's phone without a password.",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "Love it!! App pyramid is nice and educational. This app helps me keep tabs on my social usage and unwanted distractions! Check out social mornings and zen breaks!! I find these features awesome",
    "themes": [
      "Self Monitoring"
    ]
  },
  {
    "review_description": "It crashed 2 mins after i download it. Not usefull at all",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Nice way of tracking your screen time.",
    "themes": [
      "Statistics",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "Finally, an app that helps me track my facebook and twitter usage and my kid's iPad usage. Now I know when they are on the iPad watching youtube. This app and the chrome extension together are great for tracking my 'tech-time'.",
    "themes": [
      "Statistics",
      "Self Monitoring",
      "Parental Control"
    ]
  },
  {
    "review_description": "I love the ability to manage my own screen time in addition to my kids time. So much easier to for kids to agree to screen time management when I'm doing it myself",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "Was looking for a way to improve my phone habits, Zenscreen has lots of great options for tracking and limiting usage!",
    "themes": [
      "Self Monitoring",
      "Statistics",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "Because my 11 y/o was cheating with her screen time, we agreed to try this app. We haven't enforced the bedtime function yet because we don't have problems with bedtime. So far the app works as advertised and we can monitor together what apps she has been using and for how long. Straightforward setu...\nFull Review",
    "themes": [
      "Statistics",
      "Easy to Use"
    ]
  },
  {
    "review_description": "Love the simplicity of this app. I'm keeping an eye on data usage when on the network and I'd also like to be able to locate my child via GPS. Thanks!",
    "themes": [
      "Easy to Use"
    ]
  },
  {
    "review_description": "It's useful for my smart teenage daughter and mom control.",
    "themes": [
      "Useful"
    ]
  },
  {
    "review_description": "Great app to manage kids screen time. Super easy to use. Works on all devices including iPhone. Reduces so many fights in our family regarding screen time.",
    "themes": [
      "Parental Control",
      "Easy to Use"
    ]
  },
  {
    "review_description": "Wow, this looks like a great app for parents who want to manage kids phone time!",
    "themes": [
      "Parental Control"
    ]
  },
  {
    "review_description": "Didn't work. Kept crashing and quiet time didn't block anything.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Great design. But features are lacking, especially for the price.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "App is good but I uninstalled it because after installing this my mobile was freezing and facebook videos were auto pausing. Samsung S8",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Pretty nice app that allows me to better track my phone usage and makes me more productive and less on facebook",
    "themes": [
      "Statistics",
      "Self Monitoring",
      "Productivity"
    ]
  },
  {
    "review_description": "Excellent app. Just what I needed for my kids.",
    "themes": [
      "Useful"
    ]
  },
  {
    "review_description": "Great idea and nicely done!",
    "themes": [
      "Good Idea"
    ]
  },
  {
    "review_description": "Your digital diet...awsome!",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "Stuck at permission screen.. cant confirm cant go back cant do nothing..",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Great idea! This app helped me a lot",
    "themes": [
      "Good Idea"
    ]
  },
  {
    "review_description": "Very good idea Very helpful",
    "themes": [
      "Useful"
    ]
  },
  {
    "review_description": "Really helpful to track my daily phone usage.",
    "themes": [
      "Statistics",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "Really Helped me limit my phone usage",
    "themes": [
      "Time Management",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "Tracks apps that work in the background",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It show much lower usage than real.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Great app, slight problem",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Should provide better ui",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "Didn't work. Period.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "This app does exactly what I want it to do and I've had no problems. Just a suggestion, could there maybe be an option implemented so we can see the usage time in whole hours instead of days?",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Doesn't work at all (lollipop)",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I love this app the only thing I coukd see to make it better is if the time for tracking the data was better definde to standard time today, yesterday, this week, last week, this month, last month etc etc.. regardless it is 5☆.",
    "themes": [
      "Detailing"
    ]
  },
  {
    "review_description": "Works, but missing a feature I was looking for",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Does what it says (but does not work on LG G3 (Lollipop 5.0.1), which is due to LG's Android version).",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Some app used not showing, like playstore. Also time calculated not accurately. Please update.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "This app is great, I was about to give it 5 stars but then I realised that it does not track video chat of whatsapp....can this please be updated ? Thanks",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Suggestion : The app should show icon on status bar or notification area, so that user will know whether it still works or not.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Please add app usage notification setting",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Really cool app - the only bad thing about it is that it doesn't use material design.",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "I was expecting a way to import csv file after resetting my phone. No way to import",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Stops tracking very often",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It contains bug. The app is showing all apps in \"Not used at all\" option..",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Worked, then stopped..",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Can you provide a option to see when the app was opened and when closed",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "I so wish it would have worked",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Apps running in the background shouldn't be monitored",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Great app but how do I import my data to another device once I export it?????",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Great idea to monitor self discipline and children",
    "themes": [
      "Self Monitoring",
      "Parental Control"
    ]
  },
  {
    "review_description": "New update wiped all existing data. Big down thumb",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "The time counter is off, it does not accurately track usage by day. It's a cutoff issue. Adjusting the options didn't help.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Why does it count the time, when phone is locked. It is supposed to count the time when screen is on.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Since the update today, all my data is gone and it's logged me being on my phone for 9 hours when at the time I hadn't even been up that long.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "A brilliant little app which gives a good perspective of how much we use our phone on a daily, weekly or monthly basis. Clean, light and requires none of the excessive permissions the more common apps demand. Nice Job!",
    "themes": [
      "Statistics",
      "Awareness"
    ]
  },
  {
    "review_description": "It's inaccurate. The clock keeps restarting. So I never how long I've actually been on my phone. Definitely has room for improvement.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I was probably on my phone for like 1hour today(not much at all at least) and it said I was on for 12 hours NOT TRUE! I actually have a life.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It dosent work properly. I was on my pfone for like an hour, and it said something like 4 hours!",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "New update wiped all existing data. Big down thumb",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "The time counter is off, it does not accurately track usage by day. It's a cutoff issue. Adjusting the options didn't help.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Why does it count the time, when phone is locked. It is supposed to count the time when screen is on.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Since the update today, all my data is gone and it's logged me being on my phone for 9 hours when at the time I hadn't even been up that long.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It's inaccurate. The clock keeps restarting. So I never how long I've actually been on my phone. Definitely has room for improvement.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I was probably on my phone for like 1hour today(not much at all at least) and it said I was on for 12 hours NOT TRUE! I actually have a life.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "It dosent work properly. I was on my pfone for like an hour, and it said something like 4 hours!",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "This is a very helpful app for anyone wanting to stay off their phones. Not only does it provide you with the exact number of times you've checked your phones, it also displays a graph showing your development over a week.",
    "themes": [
      "Statistics",
      "Awareness"
    ]
  },
  {
    "review_description": "Good app . Working very nice. Help us to see what we used in mobile . Very nice app",
    "themes": [
      "Statistics",
      "Awareness"
    ]
  },
  {
    "review_description": "Tracks app usage just like I wanted. I like that I can choose which apps to track. Easy to use, gives me the info I want. It would be great if I could export the data as a txt or csv file. Heads up: October is not spelled with a k.",
    "themes": [
      "Statistics"
    ]
  },
  {
    "review_description": "The app is quite good but day wise usage ( at least last 7 days) should be introduced. Graphical representations should be improved",
    "themes": [
      "Add Features",
      "Design Flaws"
    ]
  },
  {
    "review_description": "Good app . Helped me alot to track usage of unwanted apps. Thx developers.",
    "themes": [
      "Statistics",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "Working fast and now i can keep track on apps usage. New timeline feature is very nice",
    "themes": [
      "Statistics"
    ]
  },
  {
    "review_description": "Hate the update, need the previous calendar view which shows day wise usage",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "App is very useful to know how I m using my apps and how much time I m using it. Thanks dev",
    "themes": [
      "Statistics",
      "Awareness"
    ]
  },
  {
    "review_description": "App is nice and really helpful. Can see the details of usage , very usefull",
    "themes": [
      "Useful",
      "Statistics"
    ]
  },
  {
    "review_description": "Hi Thx for app Whay \"Exclude Apps\" does not working !!!?",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Simple but super user experience",
    "themes": [
      "Easy to Use"
    ]
  },
  {
    "review_description": "Awesomely designed and collaboration statistics",
    "themes": [
      "Statistics"
    ]
  },
  {
    "review_description": "A great way to track the App usage.. Helps to save precious time and to locate unused, unwanted Apps which leads to manage memory allocation.. Keep it up..",
    "themes": [
      "Statistics"
    ]
  },
  {
    "review_description": "Worked fine until last update deleted all my previous usage data... Thanks for quick reply. Updated rating :)",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Doesn't track data usage, only time",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Can't disable notification",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Beautifully designed and simple to use",
    "themes": [
      "Easy to Use"
    ]
  },
  {
    "review_description": "Simple and easy to use....Fantastic app",
    "themes": [
      "Easy to Use"
    ]
  },
  {
    "review_description": "works as expected (sleep tracking not so well, the rest is fine). still trying to figure out if it's useful, but at least it's interesting. :)",
    "themes": [
      "Useful"
    ]
  },
  {
    "review_description": "got it working after making sure app wasnt disabled when not in use but sleep log still doesnt work. emailed support but got no response. Nice idea though.",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "Why sometimes it says: you've used your phone yesterday for 26 hr!! Strange",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I am rather disappointed. The only working feature is the app usage. But I'm not interested in such thing. Uninstalled.",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Wish I could track against customised categories as well",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "4 stars because this has in-app purchases for some features. I know its a business thing at last. But i can say app makers can provide us the same features for free by diaplaying ads in the app. That'd still be cool right?",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Great to keep track of daily life",
    "themes": [
      "Statistics",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "Great app to begin balancing your digital and real life.",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "Great app. It provides some great insight into how much you're using your phone. One issue though, when wanting to not automatically track location, unchecking that box isn't being saved. Every time I check back the box is checked again. I'm not seeing a \"save\" button so I assume that it's supposed ...\nFull Review",
    "themes": [
      "Statistics",
      "Awareness"
    ]
  },
  {
    "review_description": "nice idea but it's really limited in the ways you can browse the tracked data. the information is all their but you can not make use of it in any functional way. there are preconfigured summaries but absolutely no options to customize. if it were possible to set filters to manage what days is stored...\nFull Review",
    "themes": [
      "Good Idea",
      "Detailing"
    ]
  },
  {
    "review_description": "Good app.thank you, helps me a lot everyday in tracking my activities.",
    "themes": [
      "Useful",
      "Statistics"
    ]
  },
  {
    "review_description": "Hey Instant, I can't save places anymore, help?? I love this app help me out!!",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Uses a lot of battery and processor power on my phone. Doesn't track sleep as well as it used to!",
    "themes": [
      "Performance"
    ]
  },
  {
    "review_description": "This is the best way to stop cellphone addiction",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "Premium Version is too expensive😑",
    "themes": [
      "Price"
    ]
  },
  {
    "review_description": "The tracking is not accurate",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Lot less for free version",
    "themes": [
      "Price"
    ]
  },
  {
    "review_description": "First of all I have the pro version and I decided to depend on it for a university project.. unfortunately many things put me down .. I really don't know where to begin .. one thing that I noticed that most of us will not notice is that the data itself that it tracks is not accurate .. since I had t...\nFull Review",
    "themes": [
      "Studying"
    ]
  },
  {
    "review_description": "It's awesome to get to know the data this generates. I'd put it to better use, like say... Being able to ask the coach to notify me when I get to 30 min of use of Instagram so I'm reminded to stop using it longer than that",
    "themes": [
      "Statistics",
      "Timers & Blockers"
    ]
  },
  {
    "review_description": "I am Many app for tracking sreen time but, this app is help me alot Thanks to your team. But screen time was not accurate. Fix this problem",
    "themes": [
      "Useful",
      "Accurate"
    ]
  },
  {
    "review_description": "You need to have pro to do anything basically",
    "themes": [
      "Price"
    ]
  },
  {
    "review_description": "1Good concept but isn't worth a damn unless you have the pro version! Severely limited on the free version. 5 days and it only tracked 1and said I slept 2.3 hours. It's got a ways to go..",
    "themes": [
      "Good Idea",
      "Price"
    ]
  },
  {
    "review_description": "pretty good if you want to track the time spent on ur phone on day to day basis",
    "themes": [
      "Statistics",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "Good Good app for tracking your phone usage Nice app",
    "themes": [
      "Statistics",
      "Self Monitoring"
    ]
  },
  {
    "review_description": "High potential, but hard to get a look at underlying data and info. On the weekly stats for places, it says \"Add places to view weekly stats\" but I have work and home set up in my places. It provides the data when you click on individual days, but won't provide the summary for the week. There are s...\nFull Review",
    "themes": [
      "Good Idea",
      "Bugs"
    ]
  },
  {
    "review_description": "Works perfectly, and incredibly illuminating on just how bad our phone addiction is.",
    "themes": [
      "Statistics",
      "Awareness"
    ]
  },
  {
    "review_description": "Great! Can you add a time graph showing when the screen/wifi/data is on/off/connected? It helps to track when my phone leaves/enters a certain place",
    "themes": [
      "Statistics"
    ]
  },
  {
    "review_description": "Works efficiently better than the other similar apps i have tried yet",
    "themes": [
      "Accurate"
    ]
  },
  {
    "review_description": "best apps...it gives you all detail whatever you want",
    "themes": [
      "Accurate"
    ]
  },
  {
    "review_description": "Easy and quick gathering of useful information great",
    "themes": [
      "Useful",
      "Easy to Use"
    ]
  },
  {
    "review_description": "Thank you for caring about our time.",
    "themes": [
      "Time Management"
    ]
  },
  {
    "review_description": "Dont buy this app. It wont work unless you agree to some subscription. Most apps you pay just once. This guy wants to be paid yearly or quarterly. Its just not good enough of an app to justify that. Im sure I'll be able to find an app that does the same thing either for free or where i only need ...\nFull Review",
    "themes": [
      "Price"
    ]
  },
  {
    "review_description": "Why its using mobile data even when mobile data is turn off. I just find out about that in 1 month this app use my mobile data 7 time. Please fix this issue",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "I want to ask ,why this application suddenly clear ? But only day cant seen , example on 5july i can see, but 6july there is lost , and 7july i can see .. Only 6july i cant see.. Why ? Can anyone tell me pls.. Can i solve it ?",
    "themes": [
      "Bugs"
    ]
  },
  {
    "review_description": "Thought would be good but clunky and impenetrable gives info but little control.",
    "themes": [
      "Bypassable"
    ]
  },
  {
    "review_description": "Good one.. can this be enhanced to add friends and family. want to conduct a mini competition to reduce the phone usage :-)",
    "themes": [
      "Rewards & Motivation"
    ]
  },
  {
    "review_description": "6/18/18: App has gotten extremely slow to open with recent update on all my devices. Suggestion for Developer: Please add a tab for App storage location on Manage Apps screen. I'm routinely transferring apps to the SD Card. Such a feature would be very helpful in this regard. Previous Review: I ...\nFull Review",
    "themes": [
      "Performance"
    ]
  },
  {
    "review_description": "Was hoping I'd get a view into what apps do in the background and troubleshoot what is causing performance degradation on my device. This app just shows me a history of me installing and interacting with apps, but no background activity. It's not a bad app if this is when used as intended.",
    "themes": [
      "Performance"
    ]
  },
  {
    "review_description": "I really enjoyed it and bought a pro version — for the first time in my life! I've noticed a minor UI drawback. There are a number of modal windows where you set some amount of time. The windows require to set the time through slider, and it's really inconvenient. Hope it will be fixed in future...\nFull Review",
    "themes": [
      "Design Flaws"
    ]
  },
  {
    "review_description": "Can you show avg stats of all the people? To see if you are way above the normal people in phone usage. I have seen other app usage apps that do this. Otherwise great app. Old review from 2016: But I am still addicted to the phone. I am reducing it a little every day.",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "Best of its kind. Would be even better if there was a quick way to monitor the total time spent on usage-limited apps overall. There is the feature to ignore the usage of certain apps, but it would be great to be able to see both the total phone usage (including non-limited apps) and the time spe...\nFull Review",
    "themes": [
      "Detailing"
    ]
  },
  {
    "review_description": "I use this every day to track my sleep, oddly enough (sleep apps don't accomplish what I need). This consistently shows exactly what I need to be sure I was asleep.",
    "themes": [
      "Sleeping"
    ]
  },
  {
    "review_description": "Decent app, but the ads are getting ridiculously intrusive. Prefer to switch to another app instead of paying for this one.",
    "themes": [
      "Price"
    ]
  },
  {
    "review_description": "I wonder why this app has only 4.3 stars..this thing is solo gud and tells all my usage along with long term analysis..must download if u want to stop wasting ur time on ur phone",
    "themes": [
      "Self Monitoring",
      "Statistics",
      "Impulse Control"
    ]
  },
  {
    "review_description": "Superb app 😃 All your require reports on your screen As per your reply 5 star ;-) By the way it's nice app",
    "themes": [
      "Statistics"
    ]
  },
  {
    "review_description": "A huge benefit to be able to track how much time I'm wasting on my phone! A must have app for sure.",
    "themes": [
      "Self Monitoring",
      "Statistics",
      "Time Management"
    ]
  },
  {
    "review_description": "Thank you! Made me take a real hard look into my cellular habits",
    "themes": [
      "Statistics"
    ]
  },
  {
    "review_description": "Impressive! Really happy, it will more uswful if had feature to hide it self and open only when admin enter pre determined code on dial pad like AppLock feature!",
    "themes": [
      "Add Features"
    ]
  },
  {
    "review_description": "I love this app ! Globally recommended to all smartphone users worldwide to track their device usage in 24hours and each app usage duration ! Nice !!! Fabulous work by SAM LU !",
    "themes": [
      "Self Monitoring",
      "Statistics"
    ]
  },
  {
    "review_description": "Awesome app! Now I need to take care of my smart phone habits 😁",
    "themes": [
      "Statistics"
    ]
  },
  {
    "review_description": "Works as advertised! It really helps me understand where my time went. Recommended!",
    "themes": [
      "Self Monitoring",
      "Statistics"
    ]
  },
  {
    "review_description": "Good app to track addiction!",
    "themes": [
      "Addiction"
    ]
  },
  {
    "review_description": "Everyone who's aiming for productivity should have this. Best for time management",
    "themes": [
      "Productivity",
      "Time Management"
    ]
  }
]
